{
  "version": "1.0",
  "domains": [
    {
      "name": "Frameworks & Standards",
      "slug": "frameworks",
      "description": "Industry-recognized cybersecurity and governance frameworks that provide structured approaches to managing information security, IT governance, and organizational risk.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "frameworks-f01",
              "title": "Introduction to GRC Frameworks",
              "objectives": [
                "Explain what a GRC framework is and why organizations adopt them",
                "Distinguish between frameworks, standards, regulations, and guidelines",
                "Identify the major GRC frameworks and their primary use cases"
              ],
              "keyTerms": ["framework", "standard", "control", "compliance baseline", "control objective"],
              "promptHints": "Start with the big picture—why frameworks exist and the problems they solve. Use the analogy of building codes for cybersecurity. Compare voluntary frameworks (NIST CSF) vs. certifiable standards (ISO 27001) vs. regulatory mandates (PCI-DSS). Give real-world examples of companies choosing frameworks based on industry, geography, and maturity."
            },
            {
              "id": "frameworks-f02",
              "title": "NIST Cybersecurity Framework (CSF) Overview",
              "objectives": [
                "Describe the five core functions of NIST CSF (Identify, Protect, Detect, Respond, Recover)",
                "Explain how Implementation Tiers indicate maturity",
                "Create a basic Framework Profile for a hypothetical organization"
              ],
              "keyTerms": ["core functions", "implementation tiers", "framework profile", "categories", "subcategories"],
              "promptHints": "Walk through each of the five functions with concrete examples—e.g., asset inventory for Identify, access controls for Protect. Discuss the NIST CSF 2.0 update and the addition of Govern. Use a small business scenario to show how someone would begin mapping their security posture to the framework. Emphasize that NIST CSF is voluntary but widely adopted."
            },
            {
              "id": "frameworks-f03",
              "title": "ISO 27001 Fundamentals",
              "objectives": [
                "Explain the purpose and structure of ISO 27001 and ISO 27002",
                "Describe the Plan-Do-Check-Act (PDCA) cycle in the context of an ISMS",
                "List the key clauses and Annex A control categories"
              ],
              "keyTerms": ["ISMS", "Annex A", "Statement of Applicability", "certification body", "PDCA cycle"],
              "promptHints": "Explain ISO 27001 as an international certifiable standard for Information Security Management Systems. Contrast it with NIST CSF—ISO is prescriptive and auditable, NIST CSF is a flexible framework. Walk through the mandatory clauses (4-10) and explain Annex A controls at a high level. Use the example of a SaaS company pursuing ISO 27001 certification to win enterprise clients."
            },
            {
              "id": "frameworks-f04",
              "title": "SOC 2 Trust Services Criteria",
              "objectives": [
                "Identify the five Trust Services Criteria (Security, Availability, Processing Integrity, Confidentiality, Privacy)",
                "Distinguish between SOC 2 Type I and Type II reports",
                "Explain why SOC 2 is important for service organizations"
              ],
              "keyTerms": ["Trust Services Criteria", "Type I", "Type II", "service organization", "user entity"],
              "promptHints": "Frame SOC 2 as the 'gold standard' for SaaS and cloud service providers to demonstrate security to customers. Explain the difference between Type I (point-in-time) and Type II (over a period). Use real examples—a startup preparing for its first SOC 2 audit to close enterprise deals. Discuss common criteria mapping and how SOC 2 relates to other frameworks."
            },
            {
              "id": "frameworks-f05",
              "title": "Introduction to COBIT and CIS Controls",
              "objectives": [
                "Describe COBIT's purpose as an IT governance framework",
                "Explain the CIS Controls and their implementation groups",
                "Compare when to use COBIT vs. CIS Controls vs. other frameworks"
              ],
              "keyTerms": ["COBIT", "CIS Controls", "implementation groups", "IT governance", "enablers"],
              "promptHints": "Position COBIT as the bridge between business goals and IT management—used heavily in enterprises and by IT auditors. Contrast with CIS Controls which are more tactical and prioritized for cybersecurity defense. Explain CIS Implementation Groups (IG1, IG2, IG3) and how a small org would start with IG1. Give a scenario where an organization uses COBIT for governance and CIS Controls for technical implementation."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "frameworks-i01",
              "title": "NIST 800-53 Security Controls Deep Dive",
              "objectives": [
                "Navigate the NIST 800-53 control families and select appropriate controls",
                "Apply control baselines (Low, Moderate, High) based on system categorization",
                "Tailor controls using scoping and compensating control guidance"
              ],
              "keyTerms": ["control families", "control baselines", "FIPS 199", "compensating controls", "control enhancements"],
              "promptHints": "This is the workhorse of US federal cybersecurity. Explain the relationship between FIPS 199 (categorization), FIPS 200 (minimum requirements), and NIST 800-53 (control catalog). Walk through selecting controls for a moderate-impact system. Show how to tailor controls and document compensating controls. Use a government contractor scenario preparing for FISMA compliance."
            },
            {
              "id": "frameworks-i02",
              "title": "Framework Mapping and Crosswalks",
              "objectives": [
                "Map controls between two or more frameworks (e.g., NIST CSF to ISO 27001)",
                "Use crosswalk documents to streamline multi-framework compliance",
                "Identify common controls that satisfy multiple framework requirements"
              ],
              "keyTerms": ["crosswalk", "control mapping", "common controls", "unified control framework", "harmonization"],
              "promptHints": "Show how organizations dealing with multiple frameworks can avoid duplicate effort. Walk through a practical mapping exercise—e.g., map NIST CSF Identify function to ISO 27001 Annex A controls. Discuss tools like the NIST OLIR program and UCF. Use the scenario of a healthcare cloud provider that needs HIPAA, SOC 2, and ISO 27001 alignment."
            },
            {
              "id": "frameworks-i03",
              "title": "Implementing ISO 27001: Building an ISMS",
              "objectives": [
                "Define the ISMS scope and boundaries for an organization",
                "Conduct a gap analysis against ISO 27001 requirements",
                "Develop a Statement of Applicability and risk treatment plan"
              ],
              "keyTerms": ["ISMS scope", "gap analysis", "risk treatment plan", "Statement of Applicability", "internal audit"],
              "promptHints": "Move from theory to practice—this is about actually building an ISMS. Walk through scoping decisions (which business units, locations, systems to include). Show how to perform a gap analysis by reviewing each clause and Annex A control. Discuss creating the Statement of Applicability and justifying excluded controls. Use a mid-size fintech company as the running example."
            },
            {
              "id": "frameworks-i04",
              "title": "SOC 2 Readiness and Control Implementation",
              "objectives": [
                "Design and implement controls mapped to Trust Services Criteria",
                "Prepare evidence packages for SOC 2 auditors",
                "Identify and remediate gaps before a SOC 2 examination"
              ],
              "keyTerms": ["readiness assessment", "control description", "evidence collection", "management assertion", "complementary user entity controls"],
              "promptHints": "Focus on the practical journey to SOC 2 compliance. Walk through a readiness assessment—identifying which TSC apply, documenting control descriptions, collecting evidence. Discuss common gaps (no formal change management, missing access reviews, inadequate logging). Use a B2B SaaS company preparing for their first SOC 2 Type II as the scenario."
            },
            {
              "id": "frameworks-i05",
              "title": "Maturity Models and Control Assessment",
              "objectives": [
                "Apply capability maturity models (CMM/CMMI concepts) to security programs",
                "Assess the maturity of controls using defined rating scales",
                "Develop a roadmap to advance framework implementation maturity"
              ],
              "keyTerms": ["maturity model", "capability level", "process maturity", "maturity assessment", "roadmap"],
              "promptHints": "Explain how maturity models help organizations measure where they are and plan where they need to go. Cover CMMI-style levels (Initial, Managed, Defined, Quantitatively Managed, Optimizing) applied to security. Walk through rating controls on a maturity scale and using results to prioritize improvements. Use the example of a company that passed its SOC 2 audit but wants to move from reactive to proactive security."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "frameworks-a01",
              "title": "Designing a Unified Control Framework",
              "objectives": [
                "Architect a unified control framework that maps to multiple standards and regulations",
                "Rationalize overlapping controls to reduce redundancy and audit fatigue",
                "Establish a governance model for maintaining the unified framework over time"
              ],
              "keyTerms": ["unified control framework", "control rationalization", "regulatory mapping", "framework governance", "continuous compliance"],
              "promptHints": "This is a strategic, senior-level topic. Discuss how large enterprises consolidate dozens of frameworks into a single internal control framework. Cover the design process—selecting a base framework, mapping others to it, identifying unique controls. Discuss governance for keeping it current as frameworks update. Use a global financial services firm as the example, dealing with SOX, PCI-DSS, GDPR, ISO 27001, and NIST simultaneously."
            },
            {
              "id": "frameworks-a02",
              "title": "Framework Selection and Program Strategy",
              "objectives": [
                "Evaluate and recommend frameworks based on organizational context, industry, and regulatory requirements",
                "Build a business case for framework adoption including cost-benefit analysis",
                "Design a phased implementation strategy with milestones and success metrics"
              ],
              "keyTerms": ["strategic alignment", "business case", "program charter", "success metrics", "phased implementation"],
              "promptHints": "Position this as a CISO-level decision. Walk through how to evaluate which frameworks to adopt—considering industry (healthcare vs. finance vs. tech), geography (US vs. EU vs. global), customer requirements, and regulatory mandates. Show how to build a compelling business case with ROI analysis. Use the scenario of a newly hired CISO at a growing company that has no formal security framework."
            },
            {
              "id": "frameworks-a03",
              "title": "Automation and GRC Tooling for Framework Management",
              "objectives": [
                "Evaluate GRC platforms for framework management and compliance automation",
                "Design automated evidence collection and control monitoring workflows",
                "Implement continuous compliance monitoring using APIs and integrations"
              ],
              "keyTerms": ["GRC platform", "compliance automation", "continuous monitoring", "API integration", "evidence automation"],
              "promptHints": "Cover the technology landscape—tools like ServiceNow GRC, Drata, Vanta, Archer, OneTrust, and how they automate framework compliance. Discuss automated evidence collection (pulling configs from AWS, Azure, GCP), continuous control monitoring, and reducing manual audit prep. Walk through designing an automation workflow for a SOC 2 program. Discuss build vs. buy decisions."
            },
            {
              "id": "frameworks-a04",
              "title": "Emerging Frameworks and Regulatory Trends",
              "objectives": [
                "Analyze emerging cybersecurity frameworks and their implications (e.g., NIST AI RMF, SEC cyber rules)",
                "Assess the impact of evolving regulations on existing framework implementations",
                "Develop strategies for adapting GRC programs to regulatory change"
              ],
              "keyTerms": ["NIST AI RMF", "SEC cyber disclosure", "DORA", "NIS2", "regulatory horizon scanning"],
              "promptHints": "Look at what's coming next in the frameworks world. Cover NIST AI RMF for AI governance, SEC cybersecurity disclosure rules, EU's DORA for financial services, NIS2 directive, and the push toward software supply chain security (NIST SSDF). Discuss how organizations should do regulatory horizon scanning and maintain adaptable GRC programs. Frame this as strategic planning for the next 3-5 years."
            },
            {
              "id": "frameworks-a05",
              "title": "Communicating Framework Value to Executive Leadership",
              "objectives": [
                "Translate framework compliance status into executive-level dashboards and metrics",
                "Present framework adoption ROI to board members and C-suite stakeholders",
                "Align framework reporting with business objectives and risk appetite"
              ],
              "keyTerms": ["executive dashboard", "KPIs", "KRIs", "board reporting", "risk appetite alignment"],
              "promptHints": "Bridge the gap between technical framework compliance and business value. Show how to build executive dashboards that translate control compliance percentages into business risk language. Discuss key metrics: coverage ratios, time-to-compliance, cost per control, audit findings trends. Walk through a board presentation scenario where you're justifying continued investment in the GRC program."
            }
          ]
        }
      ]
    },
    {
      "name": "Risk Management",
      "slug": "risk",
      "description": "Systematic identification, analysis, evaluation, and treatment of risks to organizational objectives, including quantitative and qualitative methodologies, enterprise risk management, and risk-informed decision making.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "risk-f01",
              "title": "Introduction to Risk Management Concepts",
              "objectives": [
                "Define risk, threat, vulnerability, likelihood, and impact in a security context",
                "Explain the risk management lifecycle and its key phases",
                "Describe common risk management frameworks (ISO 31000, NIST RMF, COSO ERM)"
              ],
              "keyTerms": ["risk", "threat", "vulnerability", "likelihood", "impact"],
              "promptHints": "Build intuition around risk using everyday analogies before diving into security-specific definitions. Explain the risk equation (Risk = Threat × Vulnerability × Impact). Cover the basic lifecycle: identify, analyze, evaluate, treat, monitor. Introduce the major risk frameworks at a high level. Use examples like a retail company assessing the risk of a data breach."
            },
            {
              "id": "risk-f02",
              "title": "Risk Identification Techniques",
              "objectives": [
                "Apply brainstorming, checklists, and interview techniques to identify risks",
                "Categorize risks by type (strategic, operational, financial, compliance, cyber)",
                "Document identified risks using a structured risk register format"
              ],
              "keyTerms": ["risk identification", "risk register", "risk category", "risk owner", "threat modeling"],
              "promptHints": "Focus on practical techniques for finding risks. Walk through a brainstorming session, show how to use checklists from frameworks, and demonstrate interview techniques for gathering risk information from stakeholders. Show a sample risk register and explain each field. Use the scenario of a company launching a new cloud-based product and identifying associated risks."
            },
            {
              "id": "risk-f03",
              "title": "Qualitative Risk Analysis",
              "objectives": [
                "Construct and use a risk matrix (likelihood × impact) to rate risks",
                "Apply consistent rating scales for likelihood and impact",
                "Prioritize risks based on qualitative analysis results"
              ],
              "keyTerms": ["risk matrix", "heat map", "likelihood scale", "impact scale", "risk rating"],
              "promptHints": "This is the most common risk analysis method in practice. Walk through building a 5×5 risk matrix with clear definitions for each level. Show how to rate risks consistently across the organization. Discuss common pitfalls—subjective bias, anchoring, inconsistent scales. Use examples of rating risks like ransomware attack, insider threat, and regulatory fine."
            },
            {
              "id": "risk-f04",
              "title": "Risk Treatment Options",
              "objectives": [
                "Explain the four risk treatment strategies: mitigate, accept, transfer, avoid",
                "Select appropriate risk treatments based on risk analysis results",
                "Document risk treatment decisions and develop action plans"
              ],
              "keyTerms": ["risk mitigation", "risk acceptance", "risk transfer", "risk avoidance", "residual risk"],
              "promptHints": "Use clear examples for each treatment option—mitigate (implement MFA to reduce credential theft risk), transfer (buy cyber insurance), avoid (don't store credit card data), accept (acknowledge low-impact risk with documented rationale). Discuss when each option is appropriate and how to determine residual risk after treatment. Show how to create a risk treatment plan with owners, deadlines, and success criteria."
            },
            {
              "id": "risk-f05",
              "title": "Risk Appetite, Tolerance, and Thresholds",
              "objectives": [
                "Distinguish between risk appetite, risk tolerance, and risk capacity",
                "Explain how risk appetite statements guide decision-making",
                "Identify when a risk exceeds organizational tolerance thresholds"
              ],
              "keyTerms": ["risk appetite", "risk tolerance", "risk capacity", "risk threshold", "risk appetite statement"],
              "promptHints": "Use the personal finance analogy—appetite is how much risk you want to take, tolerance is how much you can handle, capacity is the maximum you can survive. Show real examples of risk appetite statements from different industries. Discuss how these concepts drive actual decisions—what happens when a risk exceeds tolerance? Who decides? Walk through a scenario where a CISO presents a risk that exceeds the organization's stated appetite."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "risk-i01",
              "title": "Quantitative Risk Analysis Methods",
              "objectives": [
                "Calculate Annualized Loss Expectancy (ALE) using SLE and ARO",
                "Apply the FAIR (Factor Analysis of Information Risk) model to decompose risk",
                "Compare quantitative and qualitative approaches and when to use each"
              ],
              "keyTerms": ["ALE", "SLE", "ARO", "FAIR model", "Monte Carlo simulation"],
              "promptHints": "Walk through the classic ALE calculation step by step with real numbers—e.g., a data breach with an SLE of $500K and ARO of 0.2 gives an ALE of $100K. Then introduce FAIR as a more sophisticated approach that decomposes risk into threat event frequency and loss magnitude. Show how Monte Carlo simulation provides a range of outcomes. Discuss limitations of both approaches and when to use quantitative vs. qualitative."
            },
            {
              "id": "risk-i02",
              "title": "Risk Assessment Methodologies",
              "objectives": [
                "Conduct a structured risk assessment following NIST 800-30 methodology",
                "Perform threat modeling using STRIDE or PASTA frameworks",
                "Document and present risk assessment findings to stakeholders"
              ],
              "keyTerms": ["NIST 800-30", "STRIDE", "PASTA", "threat scenario", "risk assessment report"],
              "promptHints": "Walk through a complete risk assessment from scoping to reporting. Use NIST 800-30 as the primary methodology—identify threat sources, threat events, vulnerabilities, likelihood, and impact. Show how STRIDE (Spoofing, Tampering, Repudiation, Information Disclosure, Denial of Service, Elevation of Privilege) helps identify threats systematically. Include a sample risk assessment report outline. Use a web application risk assessment as the working example."
            },
            {
              "id": "risk-i03",
              "title": "Risk Registers and Risk Reporting",
              "objectives": [
                "Design and maintain a comprehensive risk register with all required fields",
                "Create risk reports and dashboards for different audiences (operational, executive, board)",
                "Track risk trends and key risk indicators (KRIs) over time"
              ],
              "keyTerms": ["risk register", "key risk indicator", "risk dashboard", "risk trend", "risk reporting cadence"],
              "promptHints": "Go deep on the risk register as a living document. Cover all essential fields: risk ID, description, category, owner, inherent rating, controls, residual rating, treatment plan, status, last review date. Show how to build different views for different audiences. Discuss KRIs and how to set thresholds that trigger action. Use the example of a quarterly risk review process at a mid-size financial services firm."
            },
            {
              "id": "risk-i04",
              "title": "Control Effectiveness and Risk Reduction",
              "objectives": [
                "Evaluate the design and operating effectiveness of security controls",
                "Measure how controls reduce inherent risk to residual risk levels",
                "Identify control gaps and develop remediation priorities"
              ],
              "keyTerms": ["inherent risk", "residual risk", "control effectiveness", "control gap", "defense in depth"],
              "promptHints": "Bridge risk management and control frameworks. Show how to assess whether a control is well-designed (design effectiveness) and whether it's actually working (operating effectiveness). Walk through calculating residual risk after applying controls. Discuss the concept of defense in depth and how multiple controls reduce risk. Use the example of evaluating access control effectiveness across an organization."
            },
            {
              "id": "risk-i05",
              "title": "IT and Cyber Risk Scenarios",
              "objectives": [
                "Develop realistic cyber risk scenarios using threat intelligence",
                "Estimate financial impact of cyber incidents using industry data",
                "Use scenario analysis to stress-test risk management decisions"
              ],
              "keyTerms": ["scenario analysis", "threat intelligence", "cyber risk quantification", "Verizon DBIR", "loss distribution"],
              "promptHints": "Build practical cyber risk scenarios using real-world data. Reference the Verizon DBIR, IBM Cost of a Data Breach report, and Ponemon studies for realistic numbers. Walk through creating scenarios like 'ransomware attack on critical systems' or 'insider data exfiltration' with estimated frequency and financial impact. Show how scenario analysis informs investment decisions—should we spend $200K on a new tool that reduces a $2M risk by 60%?"
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "risk-a01",
              "title": "Enterprise Risk Management (ERM) Integration",
              "objectives": [
                "Design an ERM program that integrates cyber risk with operational, financial, and strategic risk",
                "Implement COSO ERM or ISO 31000 across the enterprise",
                "Establish risk governance structures including risk committees and escalation paths"
              ],
              "keyTerms": ["ERM", "COSO ERM", "ISO 31000", "risk committee", "risk aggregation"],
              "promptHints": "This is the strategic, enterprise-wide view. Show how cyber/IT risk fits into the broader ERM landscape alongside financial, operational, strategic, and reputational risk. Walk through implementing COSO ERM—its five components and 20 principles. Discuss risk governance: who sits on the risk committee, how often they meet, escalation paths, and how risk is integrated into strategic planning. Use a large healthcare organization as the example."
            },
            {
              "id": "risk-a02",
              "title": "Advanced Risk Quantification with FAIR",
              "objectives": [
                "Build a complete FAIR risk analysis for a complex scenario with multiple threat communities",
                "Use Monte Carlo simulation tools to generate loss exceedance curves",
                "Present risk quantification results to support capital allocation decisions"
              ],
              "keyTerms": ["FAIR ontology", "loss exceedance curve", "Monte Carlo", "threat community", "loss magnitude"],
              "promptHints": "Go deep on FAIR as a quantitative risk model. Walk through the complete FAIR ontology—Loss Event Frequency (TEF × Vulnerability) and Loss Magnitude (Primary Loss + Secondary Loss). Show how to estimate inputs using calibrated expert judgment. Demonstrate Monte Carlo simulation results and how to read a loss exceedance curve. Use this to answer the question: 'What is the probable range of losses from a cloud data breach over the next 12 months?'"
            },
            {
              "id": "risk-a03",
              "title": "Risk-Informed Decision Making",
              "objectives": [
                "Apply risk analysis results to prioritize security investments and resource allocation",
                "Use decision trees and cost-benefit analysis for risk treatment selection",
                "Integrate risk information into strategic planning and budgeting processes"
              ],
              "keyTerms": ["risk-based prioritization", "cost-benefit analysis", "decision tree", "return on security investment", "risk-informed budgeting"],
              "promptHints": "This is about using risk data to make better business decisions. Show how to build a cost-benefit analysis for security investments—compare ALE reduction to control implementation and maintenance costs. Walk through a decision tree for choosing between risk treatment options. Discuss how to present risk-based budget requests to CFOs and boards. Use the example of justifying a $1M investment in a Zero Trust architecture."
            },
            {
              "id": "risk-a04",
              "title": "Emerging and Systemic Risk",
              "objectives": [
                "Identify and assess emerging risks (AI, quantum computing, geopolitical, climate)",
                "Analyze systemic and concentration risks across the organization and its ecosystem",
                "Develop early warning indicators and horizon scanning processes"
              ],
              "keyTerms": ["emerging risk", "systemic risk", "concentration risk", "horizon scanning", "black swan"],
              "promptHints": "Look beyond traditional risks to emerging threats. Discuss AI-enabled attacks, quantum computing threats to cryptography, supply chain concentration risk (everyone on AWS), geopolitical risks affecting data sovereignty, and climate-related risks to infrastructure. Show how to build a horizon scanning process and develop early warning indicators. Use scenarios like 'What if a major cloud provider goes down for a week?' or 'How does quantum computing affect our encryption timeline?'"
            },
            {
              "id": "risk-a05",
              "title": "Building a Risk-Aware Culture",
              "objectives": [
                "Design programs that embed risk awareness into organizational culture and decision-making",
                "Develop risk champion networks and risk communication strategies",
                "Measure and improve risk culture maturity across the organization"
              ],
              "keyTerms": ["risk culture", "risk champion", "tone at the top", "risk awareness", "culture assessment"],
              "promptHints": "Risk management fails without the right culture. Discuss how to move beyond checkbox compliance to genuine risk awareness. Cover strategies: risk champion networks in business units, risk-based decision frameworks for project managers, gamified risk training, and executive 'tone at the top.' Show how to measure risk culture maturity using surveys and behavioral indicators. Use the example of a company that had a major breach because risks were identified but not escalated due to cultural barriers."
            }
          ]
        }
      ]
    },
    {
      "name": "Compliance & Regulatory",
      "slug": "compliance",
      "description": "Understanding and meeting legal, regulatory, and contractual obligations across jurisdictions and industries, including data privacy, financial regulations, and sector-specific requirements.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "compliance-f01",
              "title": "Introduction to Regulatory Compliance",
              "objectives": [
                "Explain the difference between regulatory compliance, contractual compliance, and voluntary standards",
                "Identify the consequences of non-compliance (fines, legal action, reputational damage)",
                "Describe the role of regulators and enforcement agencies"
              ],
              "keyTerms": ["regulation", "compliance obligation", "enforcement action", "regulatory body", "consent decree"],
              "promptHints": "Start with why compliance matters—use real examples of fines and enforcement actions (Equifax, British Airways GDPR fine, HIPAA settlements). Explain the hierarchy: laws → regulations → standards → guidance. Discuss different regulators (FTC, HHS OCR, ICO, SEC) and their enforcement powers. Use the scenario of a company expanding into a new market and discovering new compliance obligations."
            },
            {
              "id": "compliance-f02",
              "title": "GDPR Fundamentals",
              "objectives": [
                "Identify the key principles and rights established by GDPR",
                "Determine when GDPR applies to an organization (territorial scope)",
                "Explain the roles of data controller, data processor, and Data Protection Officer"
              ],
              "keyTerms": ["data controller", "data processor", "data subject", "DPO", "lawful basis"],
              "promptHints": "Cover the seven GDPR principles (lawfulness, purpose limitation, data minimization, accuracy, storage limitation, integrity/confidentiality, accountability). Explain the six lawful bases for processing. Discuss extraterritorial scope—how GDPR applies to US companies handling EU data. Walk through data subject rights (access, rectification, erasure, portability). Use the example of a US e-commerce company that starts selling to European customers."
            },
            {
              "id": "compliance-f03",
              "title": "HIPAA Privacy and Security Rules",
              "objectives": [
                "Distinguish between HIPAA Privacy Rule, Security Rule, and Breach Notification Rule",
                "Identify covered entities and business associates under HIPAA",
                "List the administrative, physical, and technical safeguards required"
              ],
              "keyTerms": ["PHI", "covered entity", "business associate", "BAA", "minimum necessary"],
              "promptHints": "Focus on practical HIPAA understanding for GRC professionals. Explain what PHI is with clear examples. Walk through the Privacy Rule (use and disclosure rules, minimum necessary standard) and Security Rule (administrative, physical, technical safeguards). Discuss Business Associate Agreements and the chain of liability. Use the scenario of a healthtech startup building an app that handles patient data."
            },
            {
              "id": "compliance-f04",
              "title": "PCI-DSS Requirements Overview",
              "objectives": [
                "List the 12 PCI-DSS requirements and their purpose",
                "Determine PCI-DSS merchant and service provider levels",
                "Explain the difference between SAQ, ROC, and AOC"
              ],
              "keyTerms": ["cardholder data", "PCI-DSS", "SAQ", "QSA", "compensating control"],
              "promptHints": "Frame PCI-DSS as the payment card industry's mandatory security standard. Walk through the 12 requirements grouped by the six goals. Explain how to determine merchant level (1-4 based on transaction volume) and the corresponding validation requirements. Discuss the role of QSAs, SAQs, and the AOC. Use the example of an online retailer determining their PCI scope and validation requirements."
            },
            {
              "id": "compliance-f05",
              "title": "US Privacy Laws: CCPA, State Privacy, and Federal Landscape",
              "objectives": [
                "Explain CCPA/CPRA consumer rights and business obligations",
                "Compare major US state privacy laws and their key differences",
                "Describe the current US federal privacy landscape and pending legislation"
              ],
              "keyTerms": ["CCPA", "CPRA", "consumer rights", "data broker", "opt-out"],
              "promptHints": "Cover the evolving US privacy patchwork. Start with CCPA/CPRA—rights to know, delete, opt-out, and correct. Discuss thresholds for applicability. Compare with other state laws (Virginia VCDPA, Colorado CPA, Connecticut CTDPA, etc.) highlighting key differences. Touch on the push for federal privacy legislation. Use the scenario of a company operating in all 50 states trying to build a unified privacy compliance program."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "compliance-i01",
              "title": "Building a Compliance Program",
              "objectives": [
                "Design a compliance program structure with roles, responsibilities, and governance",
                "Develop compliance policies, procedures, and training programs",
                "Implement compliance monitoring, testing, and reporting mechanisms"
              ],
              "keyTerms": ["compliance program", "compliance officer", "compliance monitoring", "compliance training", "regulatory change management"],
              "promptHints": "Walk through building a compliance program from scratch. Cover the seven elements of an effective compliance program (DOJ guidance). Discuss organizational structure—where the compliance function sits, reporting lines, independence. Show how to develop a compliance obligations register, create policies mapped to requirements, and implement monitoring. Use a healthcare company building its HIPAA compliance program as the running example."
            },
            {
              "id": "compliance-i02",
              "title": "Data Privacy Program Management",
              "objectives": [
                "Conduct data mapping and create records of processing activities (ROPA)",
                "Implement Data Protection Impact Assessments (DPIAs) for high-risk processing",
                "Manage data subject requests and consent at scale"
              ],
              "keyTerms": ["data mapping", "ROPA", "DPIA", "data subject request", "consent management"],
              "promptHints": "Focus on the operational aspects of running a privacy program. Walk through data mapping—discovering what personal data exists, where it lives, who has access, and how it flows. Show how to create a ROPA and when DPIAs are required. Discuss implementing DSR workflows (authentication, response timelines, exceptions). Cover consent management platforms and preference centers. Use a SaaS company handling data across multiple jurisdictions."
            },
            {
              "id": "compliance-i03",
              "title": "SOX IT Compliance",
              "objectives": [
                "Explain the IT General Controls (ITGCs) relevant to SOX compliance",
                "Identify and test key automated and manual controls over financial reporting",
                "Support SOX audit readiness with proper documentation and evidence"
              ],
              "keyTerms": ["SOX", "ITGC", "key control", "material weakness", "significant deficiency"],
              "promptHints": "Cover SOX from the IT perspective—how IT controls support financial reporting integrity. Walk through the four ITGC categories: access to programs and data, program changes, computer operations, and program development. Show how to identify key controls, test them, and document results. Discuss the severity of findings (deficiency vs. significant deficiency vs. material weakness). Use a publicly traded company preparing for its annual SOX audit."
            },
            {
              "id": "compliance-i04",
              "title": "FedRAMP and Government Compliance",
              "objectives": [
                "Describe the FedRAMP authorization process and its three paths",
                "Map FedRAMP requirements to NIST 800-53 control baselines",
                "Prepare a System Security Plan (SSP) and supporting documentation"
              ],
              "keyTerms": ["FedRAMP", "ATO", "3PAO", "SSP", "POA&M"],
              "promptHints": "Cover FedRAMP as the gateway for cloud service providers selling to the federal government. Explain the three authorization paths (JAB, Agency, CSP-initiated). Walk through the documentation requirements—SSP, SAR, POA&M. Discuss the relationship to NIST 800-53 and the additional FedRAMP-specific requirements. Use the scenario of a cloud company pursuing FedRAMP Moderate authorization to sell to federal agencies."
            },
            {
              "id": "compliance-i05",
              "title": "Cross-Border Data Transfers and International Compliance",
              "objectives": [
                "Navigate GDPR cross-border data transfer mechanisms (SCCs, adequacy decisions, BCRs)",
                "Implement data localization requirements for different jurisdictions",
                "Manage compliance across multiple regulatory regimes simultaneously"
              ],
              "keyTerms": ["Standard Contractual Clauses", "adequacy decision", "BCR", "data localization", "transfer impact assessment"],
              "promptHints": "Address the complexity of international data flows. Cover GDPR transfer mechanisms post-Schrems II—SCCs (2021 version), adequacy decisions, BCRs, and derogations. Discuss data localization laws in countries like Russia, China, India, and Brazil. Show how to conduct a transfer impact assessment. Use the example of a multinational company with offices in the US, EU, and Asia-Pacific managing data flows between regions."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "compliance-a01",
              "title": "Regulatory Strategy and Engagement",
              "objectives": [
                "Develop a proactive regulatory engagement strategy including comment letters and industry participation",
                "Anticipate regulatory changes and position the organization for compliance",
                "Navigate regulatory examinations and enforcement actions"
              ],
              "keyTerms": ["regulatory strategy", "comment period", "regulatory examination", "enforcement action", "remediation agreement"],
              "promptHints": "Move from reactive compliance to strategic regulatory engagement. Discuss how to monitor proposed regulations, participate in comment periods, and engage with regulators proactively. Cover preparing for and managing regulatory examinations (on-site visits, document requests, interviews). Walk through responding to enforcement actions—remediation plans, consent decrees, settlement negotiations. Use the scenario of a financial services firm navigating multiple concurrent regulatory examinations."
            },
            {
              "id": "compliance-a02",
              "title": "AI Governance and Emerging Technology Compliance",
              "objectives": [
                "Apply the EU AI Act classification system and compliance requirements",
                "Implement AI governance frameworks including model risk management and bias monitoring",
                "Navigate emerging regulations around AI, IoT, and blockchain"
              ],
              "keyTerms": ["EU AI Act", "AI governance", "algorithmic bias", "model risk management", "explainability"],
              "promptHints": "Cover the rapidly evolving regulatory landscape for AI and emerging technologies. Walk through the EU AI Act risk classification (unacceptable, high-risk, limited, minimal) and compliance obligations for each tier. Discuss US AI governance (NIST AI RMF, executive orders, sector-specific guidance). Show how to implement AI governance: model inventories, bias testing, explainability requirements, and human oversight. Use the example of a company deploying AI for credit decisions or hiring."
            },
            {
              "id": "compliance-a03",
              "title": "Multi-Jurisdictional Compliance Architecture",
              "objectives": [
                "Design a scalable compliance architecture for global operations",
                "Harmonize conflicting regulatory requirements across jurisdictions",
                "Build compliance centers of excellence and regional compliance structures"
              ],
              "keyTerms": ["compliance architecture", "regulatory harmonization", "center of excellence", "jurisdictional conflict", "compliance operating model"],
              "promptHints": "Address the challenge of managing compliance globally at scale. Discuss how to design a compliance operating model—centralized vs. federated vs. hybrid. Show how to handle conflicting requirements (e.g., GDPR right to erasure vs. financial record retention requirements). Cover building compliance centers of excellence with specialized expertise. Use a global technology company operating in 40+ countries as the example."
            },
            {
              "id": "compliance-a04",
              "title": "Compliance Metrics, Reporting, and Board Communication",
              "objectives": [
                "Design compliance KPIs and metrics that demonstrate program effectiveness",
                "Build board-level compliance reports and regulatory risk dashboards",
                "Use compliance analytics to identify trends and predict regulatory issues"
              ],
              "keyTerms": ["compliance KPI", "program effectiveness", "board reporting", "compliance analytics", "regulatory risk dashboard"],
              "promptHints": "Show how to measure and communicate compliance program effectiveness. Cover leading and lagging indicators—training completion rates, policy exception trends, audit finding closure rates, regulatory inquiry response times. Discuss board reporting requirements and how to present compliance status concisely. Introduce compliance analytics—using data to identify patterns and predict issues before they become findings. Walk through building a quarterly compliance report for the board."
            },
            {
              "id": "compliance-a05",
              "title": "Industry-Specific Regulatory Deep Dive",
              "objectives": [
                "Analyze sector-specific regulatory frameworks for financial services, healthcare, or critical infrastructure",
                "Design compliance programs that address industry-specific nuances and expectations",
                "Navigate industry regulators and self-regulatory organizations"
              ],
              "keyTerms": ["sector-specific regulation", "SRO", "regulatory expectations", "industry guidance", "supervisory framework"],
              "promptHints": "Deep dive into how compliance differs by industry. Cover financial services (GLBA, FFIEC, OCC guidance, SEC/FINRA), healthcare (HIPAA, HITECH, FDA, state health laws), energy/utilities (NERC CIP), and defense/government (CMMC, ITAR, EAR). Discuss self-regulatory organizations and how they layer on top of government regulation. Show how to design an industry-specific compliance program. Use the scenario of a company pivoting from tech to a regulated industry."
            }
          ]
        }
      ]
    },
    {
      "name": "Audit & Assurance",
      "slug": "audit",
      "description": "Planning, executing, and reporting on audits to provide independent assurance over the effectiveness of controls, compliance with policies, and accuracy of organizational claims.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "audit-f01",
              "title": "Introduction to IT Audit and Assurance",
              "objectives": [
                "Explain the purpose and types of audits (internal, external, regulatory)",
                "Describe the role and responsibilities of IT auditors",
                "Identify key IT audit standards and guidelines (ISACA, IIA)"
              ],
              "keyTerms": ["IT audit", "assurance", "internal audit", "external audit", "audit charter"],
              "promptHints": "Build foundational understanding of what auditors do and why. Explain the three lines of defense model and where audit sits. Distinguish internal audit (organizational function) from external audit (independent firm) from regulatory examination. Cover the key professional standards—ISACA's ITAF, IIA's IPPF. Discuss the audit charter and auditor independence. Use the example of a new hire joining an internal audit team at a financial services company."
            },
            {
              "id": "audit-f02",
              "title": "The Audit Lifecycle",
              "objectives": [
                "Describe the phases of an audit: planning, fieldwork, reporting, follow-up",
                "Explain how audit scope and objectives are determined",
                "Create a basic audit plan with timeline and resource requirements"
              ],
              "keyTerms": ["audit planning", "fieldwork", "audit scope", "audit objective", "audit timeline"],
              "promptHints": "Walk through a complete audit lifecycle from start to finish. Cover planning (understanding the area, risk assessment, scoping), fieldwork (testing, evidence collection, interviews), reporting (findings, recommendations, management response), and follow-up (tracking remediation). Show a sample audit plan with scope statement, objectives, timeline, and team assignments. Use the example of planning an audit of access management controls."
            },
            {
              "id": "audit-f03",
              "title": "Evidence Gathering and Documentation",
              "objectives": [
                "Identify the types of audit evidence and their relative reliability",
                "Apply evidence gathering techniques: inquiry, observation, inspection, re-performance",
                "Document audit work in workpapers that support conclusions"
              ],
              "keyTerms": ["audit evidence", "workpapers", "sufficient and appropriate", "inquiry", "re-performance"],
              "promptHints": "Evidence is the foundation of audit conclusions. Explain the hierarchy of evidence reliability—external vs. internal, documentary vs. oral. Walk through each gathering technique with examples: inquiry (interviewing the sys admin), observation (watching a backup process), inspection (reviewing access reports), re-performance (testing a control yourself). Show what good workpapers look like and why documentation standards matter. Use a practical example of gathering evidence for a change management audit."
            },
            {
              "id": "audit-f04",
              "title": "Understanding Controls and Control Testing",
              "objectives": [
                "Classify controls as preventive, detective, or corrective",
                "Distinguish between design effectiveness and operating effectiveness testing",
                "Select appropriate sample sizes and testing methods"
              ],
              "keyTerms": ["preventive control", "detective control", "corrective control", "design effectiveness", "operating effectiveness"],
              "promptHints": "Connect the dots between controls and audit testing. Explain control types with clear examples—preventive (MFA prevents unauthorized access), detective (log monitoring detects anomalies), corrective (incident response corrects breaches). Walk through testing design effectiveness (does the control address the risk?) vs. operating effectiveness (has it been working consistently?). Cover sampling basics—how many items to test and why. Use the example of testing the user access provisioning process."
            },
            {
              "id": "audit-f05",
              "title": "Audit Findings and Reporting",
              "objectives": [
                "Write clear audit findings using the condition-criteria-cause-effect format",
                "Rate finding severity and develop practical recommendations",
                "Draft an audit report that communicates results effectively"
              ],
              "keyTerms": ["audit finding", "condition", "criteria", "cause", "effect"],
              "promptHints": "Findings are the deliverable—teach how to write them well. Walk through the finding format: Condition (what you found), Criteria (what should have been), Cause (why the gap exists), Effect (why it matters). Show examples of well-written vs. poorly-written findings. Discuss rating severity (critical, high, medium, low). Cover report structure: executive summary, scope, methodology, findings, recommendations. Use examples of common IT audit findings like access review gaps or incomplete change management."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "audit-i01",
              "title": "SOC Report Auditing",
              "objectives": [
                "Explain the differences between SOC 1, SOC 2, and SOC 3 reports",
                "Evaluate a SOC 2 report as a user entity (reading and assessing the report)",
                "Plan and execute a SOC 2 Type II examination as a service organization"
              ],
              "keyTerms": ["SOC 1", "SOC 2", "SOC 3", "subservice organization", "carve-out vs. inclusive"],
              "promptHints": "Deep dive into SOC reports—the backbone of vendor assurance. Explain when to use SOC 1 (financial reporting controls, SSAE 18) vs. SOC 2 (TSC-based) vs. SOC 3 (public report). Show how to read a SOC 2 report critically—management assertion, system description, tests of controls, results. Walk through planning a SOC 2 Type II—scoping, control identification, evidence preparation, auditor coordination. Discuss carve-out vs. inclusive method for subservice organizations."
            },
            {
              "id": "audit-i02",
              "title": "Risk-Based Audit Planning",
              "objectives": [
                "Develop a risk-based annual audit plan aligned with organizational risk profile",
                "Prioritize audit universe items using risk scoring methodologies",
                "Allocate audit resources based on risk priorities and stakeholder needs"
              ],
              "keyTerms": ["audit universe", "risk-based planning", "audit risk assessment", "annual audit plan", "audit coverage"],
              "promptHints": "Show how to build a risk-based audit plan rather than a rotation-based one. Walk through creating the audit universe—listing all auditable entities (business units, processes, systems, projects). Develop a risk scoring model using factors like inherent risk, control maturity, time since last audit, regulatory sensitivity, and recent changes. Show how to prioritize and allocate limited audit resources. Use a technology company with 50+ auditable areas and resources for 20 audits per year."
            },
            {
              "id": "audit-i03",
              "title": "IT General Controls (ITGC) Auditing",
              "objectives": [
                "Audit the four ITGC domains: access management, change management, computer operations, and program development",
                "Design test procedures for common ITGCs with appropriate sample sizes",
                "Identify control deficiencies and their impact on financial reporting or security"
              ],
              "keyTerms": ["ITGC", "access management", "change management", "computer operations", "program development"],
              "promptHints": "This is bread-and-butter IT audit work. Walk through each ITGC domain with specific test procedures. Access management: test user provisioning, termination, access reviews, privileged access. Change management: test change approval workflows, separation of duties, emergency changes. Computer operations: test job scheduling, backup and recovery, incident management. Program development: test SDLC controls, testing requirements, deployment procedures. Include sample sizes and what constitutes a failure. Use real-world examples of common ITGC findings."
            },
            {
              "id": "audit-i04",
              "title": "Audit Data Analytics and CAATs",
              "objectives": [
                "Apply Computer-Assisted Audit Techniques (CAATs) to improve audit efficiency",
                "Use data analytics to identify anomalies, trends, and high-risk populations",
                "Design data-driven audit tests that provide greater coverage than sampling"
              ],
              "keyTerms": ["CAATs", "data analytics", "continuous auditing", "anomaly detection", "full population testing"],
              "promptHints": "Show how data analytics transforms audit from sample-based to full-population testing. Cover common CAATs: data extraction (SQL, ACL/IDEA), analysis (duplicate detection, gap analysis, Benford's Law), and visualization. Walk through practical examples—analyzing the full population of access changes to find unauthorized modifications, or analyzing all journal entries to find unusual patterns. Discuss tools available and skills needed. Use the example of using analytics to audit expense reports or access logs."
            },
            {
              "id": "audit-i05",
              "title": "Managing the Audit Relationship",
              "objectives": [
                "Build effective working relationships with auditees and stakeholders",
                "Manage audit conflicts and challenging audit situations diplomatically",
                "Track and validate remediation of audit findings"
              ],
              "keyTerms": ["audit relationship", "management response", "remediation tracking", "audit fatigue", "stakeholder management"],
              "promptHints": "The soft skills of auditing are crucial. Discuss how to build trust with auditees—being collaborative vs. adversarial. Cover managing difficult situations: auditees who are unresponsive, management who disagrees with findings, executives who pressure for lower severity ratings. Walk through the remediation lifecycle—tracking findings, validating remediation evidence, re-testing, and closing findings. Discuss addressing audit fatigue when the organization is over-audited. Use real scenarios of audit conflicts and their resolution."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "audit-a01",
              "title": "Continuous Auditing and Monitoring",
              "objectives": [
                "Design a continuous auditing program that provides real-time assurance",
                "Implement automated control monitoring dashboards and alerting",
                "Transition from periodic to continuous audit methodologies"
              ],
              "keyTerms": ["continuous auditing", "continuous monitoring", "automated testing", "real-time assurance", "audit automation"],
              "promptHints": "This is the future of audit. Explain the difference between continuous auditing (audit function) and continuous monitoring (management function). Show how to identify controls suitable for continuous monitoring—high-frequency, data-rich, automatable. Walk through building automated tests (e.g., daily check for users without recent access reviews, automated change management compliance checks). Discuss the technology stack needed and how to present continuous audit results. Use the example of building a continuous auditing program for ITGCs."
            },
            {
              "id": "audit-a02",
              "title": "Cloud and Emerging Technology Auditing",
              "objectives": [
                "Audit cloud environments (IaaS, PaaS, SaaS) and shared responsibility models",
                "Assess controls for emerging technologies: AI/ML, containers, serverless, IoT",
                "Adapt traditional audit procedures for DevOps and agile environments"
              ],
              "keyTerms": ["cloud audit", "shared responsibility", "DevOps audit", "container security", "AI audit"],
              "promptHints": "Cover how audit must evolve for modern technology. Start with cloud auditing—understanding the shared responsibility model (what the CSP controls vs. what the customer controls) and auditing each layer. Then cover auditing in DevOps environments—CI/CD pipelines, infrastructure as code, ephemeral infrastructure. Discuss emerging technology audit challenges: how do you audit an AI model? How do you test container security? Use the scenario of auditing a company that has moved 80% of its infrastructure to AWS."
            },
            {
              "id": "audit-a03",
              "title": "Building and Leading an Audit Function",
              "objectives": [
                "Establish an internal audit function with appropriate charter, structure, and staffing",
                "Develop audit team competencies and professional development programs",
                "Implement quality assurance and improvement programs (QAIP)"
              ],
              "keyTerms": ["audit function", "audit charter", "QAIP", "co-sourcing", "professional development"],
              "promptHints": "Cover the leadership aspects of running an audit function. Discuss establishing the audit charter, organizational positioning (reporting to audit committee), and staffing models (in-house, co-sourced, outsourced). Walk through building team competencies—certifications (CISA, CIA, CISSP), training programs, career paths. Cover QAIP requirements per IIA standards—internal assessments and external quality reviews. Use the scenario of a company that has grown large enough to need its own internal audit function."
            },
            {
              "id": "audit-a04",
              "title": "Integrated Assurance and Combined Assurance Models",
              "objectives": [
                "Design an integrated assurance model that coordinates across audit, risk, and compliance",
                "Reduce duplication of effort among first, second, and third lines of defense",
                "Present a unified assurance view to the audit committee and board"
              ],
              "keyTerms": ["integrated assurance", "combined assurance", "three lines model", "assurance mapping", "audit coordination"],
              "promptHints": "Address the problem of assurance silos—multiple teams testing the same controls independently. Walk through the IIA's Three Lines Model and how to coordinate assurance activities. Show how to create an assurance map that identifies who provides assurance over what, and where gaps or overlaps exist. Discuss establishing assurance forums, sharing workpapers and results, and presenting a unified view. Use a large enterprise scenario where internal audit, external audit, compliance, and risk management are all testing similar controls."
            },
            {
              "id": "audit-a05",
              "title": "Audit Committee and Board Engagement",
              "objectives": [
                "Prepare and present audit results to audit committees effectively",
                "Navigate audit committee dynamics and expectations",
                "Align audit priorities with organizational strategy and board concerns"
              ],
              "keyTerms": ["audit committee", "board engagement", "executive reporting", "audit opinion", "annual assessment"],
              "promptHints": "This is the pinnacle of audit leadership—engaging with the board and audit committee. Cover what audit committees expect: overall opinion on control environment, significant findings, emerging risks, and audit plan updates. Show how to prepare audit committee presentations—concise, risk-focused, with clear conclusions and actionable recommendations. Discuss navigating difficult conversations: reporting significant deficiencies, disagreements with management, and requesting additional resources. Use real examples of audit committee questions and how to handle them."
            }
          ]
        }
      ]
    },
    {
      "name": "Policy & Governance",
      "slug": "policy",
      "description": "Creating, implementing, and maintaining organizational policies, governance structures, and management systems that direct and oversee information security and compliance programs.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "policy-f01",
              "title": "Introduction to Information Security Governance",
              "objectives": [
                "Define governance and distinguish it from management in the security context",
                "Identify key governance components: structures, processes, and relational mechanisms",
                "Explain how governance enables organizational accountability for security"
              ],
              "keyTerms": ["governance", "management", "accountability", "oversight", "governance framework"],
              "promptHints": "Clarify the distinction between governance (directing and controlling) and management (planning and executing). Use corporate governance analogies—board vs. CEO. Explain how security governance ensures that security investments align with business objectives and risks are managed to acceptable levels. Cover the three mechanisms: structures (committees, roles), processes (policies, reviews), and relational (culture, communication). Use the example of a fast-growing startup realizing they need formal governance."
            },
            {
              "id": "policy-f02",
              "title": "Policy Hierarchy: Policies, Standards, Procedures, and Guidelines",
              "objectives": [
                "Distinguish between policies, standards, procedures, and guidelines",
                "Explain the purpose and audience for each document type",
                "Identify the essential information security policies every organization needs"
              ],
              "keyTerms": ["policy", "standard", "procedure", "guideline", "policy hierarchy"],
              "promptHints": "Use a clear pyramid or hierarchy model. Policies are high-level management intent ('what'), standards define specific requirements ('how much'), procedures are step-by-step instructions ('how'), and guidelines are recommendations ('you should'). Give concrete examples: Acceptable Use Policy → Password Standard (min 12 characters, complexity) → Password Change Procedure → Password Selection Guideline. List the essential policies: acceptable use, access control, data classification, incident response, BYOD, etc."
            },
            {
              "id": "policy-f03",
              "title": "Writing Effective Security Policies",
              "objectives": [
                "Draft clear, enforceable security policies using standard formats",
                "Include all necessary policy components (purpose, scope, roles, statements, enforcement)",
                "Avoid common policy writing mistakes (ambiguity, over-prescription, staleness)"
              ],
              "keyTerms": ["policy statement", "policy scope", "enforcement clause", "policy owner", "policy template"],
              "promptHints": "Teach the craft of policy writing. Cover the essential sections: purpose, scope, definitions, policy statements, roles and responsibilities, enforcement, exceptions, and revision history. Show before-and-after examples of poor vs. good policy language—e.g., 'Users should use strong passwords' (bad) vs. 'All users must authenticate using passwords that meet the requirements defined in the Password Standard' (good). Discuss tone, readability, and avoiding jargon that non-technical staff won't understand."
            },
            {
              "id": "policy-f04",
              "title": "Roles and Responsibilities in Security",
              "objectives": [
                "Define common security roles: CISO, security analysts, security champions, data owners",
                "Explain the concept of ownership and how it applies to assets, risks, and data",
                "Create a RACI matrix for security activities"
              ],
              "keyTerms": ["RACI", "CISO", "data owner", "data custodian", "security champion"],
              "promptHints": "Clarify who is responsible for what in security. Walk through the key roles and their responsibilities—CISO (strategy and oversight), security team (implementation and monitoring), data owners (classification and access decisions), data custodians (technical safeguards), end users (following policy). Explain the RACI matrix (Responsible, Accountable, Consulted, Informed) and build one for a common process like incident response or access provisioning. Discuss the challenge of assigning ownership in matrixed organizations."
            },
            {
              "id": "policy-f05",
              "title": "Data Classification and Handling",
              "objectives": [
                "Design a data classification scheme appropriate for the organization",
                "Define handling requirements for each classification level",
                "Implement data labeling and user awareness for classification"
              ],
              "keyTerms": ["data classification", "handling requirements", "data labeling", "public", "confidential", "restricted"],
              "promptHints": "Data classification is foundational to many other security controls. Walk through designing a classification scheme—typically 3-4 levels (Public, Internal, Confidential, Restricted/Top Secret). For each level, define handling requirements: storage (encryption at rest?), transmission (encryption in transit?), access (who can see it?), disposal (how to destroy it?), and labeling (how to mark it?). Discuss challenges: getting business units to actually classify data, handling mixed-classification databases, and automated classification tools."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "policy-i01",
              "title": "Governance Structures and Committees",
              "objectives": [
                "Design security governance committee structures with clear charters and membership",
                "Establish a security steering committee with appropriate executive participation",
                "Create effective meeting cadences, agendas, and decision-making processes"
              ],
              "keyTerms": ["steering committee", "governance committee", "committee charter", "decision rights", "escalation path"],
              "promptHints": "Cover how to set up governance bodies that actually work. Discuss the typical committee structure: security steering committee (executive-level, quarterly), security working group (management-level, monthly), and tactical teams (operational, weekly/daily). Walk through writing a committee charter—purpose, scope, membership, decision authority, meeting frequency. Show sample agendas and how to drive decisions rather than just share information. Discuss common anti-patterns: committees that are rubber stamps, missing the right members, or meeting without clear actions."
            },
            {
              "id": "policy-i02",
              "title": "Policy Lifecycle Management",
              "objectives": [
                "Implement a complete policy lifecycle: creation, review, approval, distribution, acknowledgment, and retirement",
                "Establish policy review cycles and version control processes",
                "Manage policy exceptions with a formal exception process"
              ],
              "keyTerms": ["policy lifecycle", "policy review cycle", "policy exception", "version control", "policy acknowledgment"],
              "promptHints": "Policies are only useful if they're current and enforced. Walk through the complete lifecycle: drafting (who authors?), review (legal, HR, affected teams), approval (executive sign-off), distribution (how users access policies), acknowledgment (tracking that users have read and accepted), and retirement (sunsetting outdated policies). Cover annual review cycles and how to handle policy updates. Discuss the exception management process—when to grant exceptions, documentation requirements, time limits, and periodic re-evaluation."
            },
            {
              "id": "policy-i03",
              "title": "Security Awareness and Training Programs",
              "objectives": [
                "Design a security awareness program that changes user behavior",
                "Develop role-based security training for different audiences",
                "Measure awareness program effectiveness through metrics and testing"
              ],
              "keyTerms": ["security awareness", "phishing simulation", "role-based training", "awareness metrics", "behavior change"],
              "promptHints": "Go beyond checkbox compliance training. Discuss how to design an awareness program that actually changes behavior—using adult learning principles, engagement techniques, and regular reinforcement. Cover program components: onboarding training, annual refresher, phishing simulations, security newsletters, lunch-and-learns. Show how to create role-based training (developer security training, executive cyber briefings, administrator privileged access training). Discuss measuring effectiveness: phishing simulation click rates over time, reported incidents, quiz scores, behavioral observations."
            },
            {
              "id": "policy-i04",
              "title": "Metrics and KPIs for Security Programs",
              "objectives": [
                "Define meaningful security metrics and KPIs aligned with business objectives",
                "Build security dashboards for operational and executive audiences",
                "Use metrics to drive program improvement and investment decisions"
              ],
              "keyTerms": ["security metrics", "KPI", "KRI", "security dashboard", "MTTD/MTTR"],
              "promptHints": "What gets measured gets managed. Cover the challenge of measuring security—you can't easily measure attacks that didn't happen. Discuss categories of metrics: operational (MTTD, MTTR, patch compliance, vulnerability counts), program (policy compliance rates, training completion, audit finding closure), and risk (KRIs, risk treatment plan progress). Show how to build dashboards for different audiences. Discuss the danger of vanity metrics and how to choose metrics that drive action. Walk through creating a balanced security scorecard."
            },
            {
              "id": "policy-i05",
              "title": "Change Management and Governance in IT",
              "objectives": [
                "Implement a change management process that balances control with agility",
                "Classify changes and define appropriate approval workflows",
                "Manage emergency changes and exceptions while maintaining control"
              ],
              "keyTerms": ["change management", "CAB", "change classification", "emergency change", "change window"],
              "promptHints": "Change management is a critical governance control. Walk through designing a change management process: change request, classification (standard/normal/emergency), risk assessment, approval (CAB or pre-approved), implementation, and post-implementation review. Discuss how to balance control with development velocity—pre-approved standard changes, automated testing gates, and fast-track processes. Cover handling emergency changes (retroactive approval, documentation requirements) and how to prevent change management from becoming a bottleneck. Use a real-world scenario of a company that had an outage due to an uncontrolled change."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "policy-a01",
              "title": "Security Program Strategy and Roadmapping",
              "objectives": [
                "Develop a multi-year security strategy aligned with business objectives",
                "Create a security roadmap with prioritized initiatives, milestones, and resource requirements",
                "Present the security strategy to executive leadership and secure funding"
              ],
              "keyTerms": ["security strategy", "roadmap", "strategic planning", "capability maturity", "investment prioritization"],
              "promptHints": "This is CISO-level strategy work. Walk through developing a 3-5 year security strategy: assess current state (maturity assessment, gap analysis), define target state (aligned with business strategy and risk appetite), and build the roadmap to get there. Show how to prioritize initiatives using risk reduction, regulatory requirements, and business enablement criteria. Cover building the budget request and presenting to the board—using business language, showing ROI, and tying security investments to business outcomes. Use the scenario of a new CISO developing their first strategic plan."
            },
            {
              "id": "policy-a02",
              "title": "Organizational Design for Security Functions",
              "objectives": [
                "Design the optimal organizational structure for the security function",
                "Determine the reporting line for the CISO (CEO, CIO, CTO, General Counsel, Board)",
                "Build a staffing model that addresses skill gaps with the right mix of hiring, outsourcing, and automation"
              ],
              "keyTerms": ["organizational design", "CISO reporting line", "staffing model", "security organization", "skill gap analysis"],
              "promptHints": "Cover how to structure the security organization for maximum effectiveness. Discuss common models: centralized (single security team), federated (embedded security in business units), or hybrid. Analyze the pros/cons of different CISO reporting lines and their impact on independence and influence. Walk through workforce planning: identifying needed roles, skill gap analysis, build vs. buy decisions, managed services, and automation to multiply team capacity. Use the scenario of restructuring a security team after a major incident revealed organizational weaknesses."
            },
            {
              "id": "policy-a03",
              "title": "Board Reporting and Executive Communication",
              "objectives": [
                "Prepare board-ready security reports that convey risk in business terms",
                "Navigate board dynamics and tailor communication to different executive stakeholders",
                "Respond to board questions about security incidents, investments, and benchmarking"
              ],
              "keyTerms": ["board reporting", "executive communication", "risk narrative", "benchmarking", "fiduciary duty"],
              "promptHints": "Effective board communication is a critical CISO competency. Cover what boards want to know: Are we secure enough? Are we compliant? How do we compare to peers? Are we investing the right amount? Show how to translate technical security metrics into business risk language. Walk through preparing for a board meeting—anticipating questions, using benchmarking data, telling the risk narrative. Discuss handling crisis communication with the board during an active incident. Include SEC requirements for board-level cyber expertise."
            },
            {
              "id": "policy-a04",
              "title": "Security Culture and Business Integration",
              "objectives": [
                "Embed security into business processes, product development, and digital transformation initiatives",
                "Build security champion programs across the organization",
                "Measure and evolve organizational security culture maturity"
              ],
              "keyTerms": ["security culture", "security champion", "shift-left", "security by design", "business integration"],
              "promptHints": "Move security from a gatekeeping function to an enabler of business. Discuss shift-left and security by design—embedding security into SDLC, product development, and business processes from the beginning. Cover building a security champions program: recruiting passionate employees from other departments, training them, giving them tools and recognition. Show how to measure security culture using surveys, behavioral metrics, and incident analysis. Use the example of a company transforming from a 'security says no' culture to one where security enables innovation."
            },
            {
              "id": "policy-a05",
              "title": "GRC Program Maturity and Continuous Improvement",
              "objectives": [
                "Assess overall GRC program maturity using established maturity models",
                "Design continuous improvement programs for governance, risk, and compliance",
                "Benchmark GRC program effectiveness against industry peers and best practices"
              ],
              "keyTerms": ["program maturity", "continuous improvement", "benchmarking", "lessons learned", "maturity assessment"],
              "promptHints": "Take a holistic view of GRC program maturity. Walk through conducting a comprehensive GRC maturity assessment—evaluating governance structures, risk management processes, compliance operations, audit functions, and supporting technology. Show how to use results for prioritized improvement planning. Discuss benchmarking approaches: industry surveys, peer comparisons, maturity model scores. Cover implementing a continuous improvement cycle: assess, plan, implement, measure, adjust. Use the scenario of a company that wants to move from a reactive, compliance-driven GRC program to a proactive, risk-intelligent one."
            }
          ]
        }
      ]
    },
    {
      "name": "Incident Response & BCM",
      "slug": "incident",
      "description": "Preparing for, detecting, responding to, and recovering from security incidents, business disruptions, and disasters through structured plans, exercises, and continuous improvement.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "incident-f01",
              "title": "Introduction to Incident Response",
              "objectives": [
                "Define a security incident and distinguish it from a security event",
                "Describe the NIST incident response lifecycle (Preparation, Detection & Analysis, Containment/Eradication/Recovery, Post-Incident Activity)",
                "Identify the key roles in an incident response team (IRT)"
              ],
              "keyTerms": ["security incident", "security event", "incident response team", "NIST SP 800-61", "incident severity"],
              "promptHints": "Start with clear definitions and real examples. An event is a login attempt; an incident is a confirmed unauthorized access. Walk through the NIST 800-61 lifecycle phases with simple examples. Introduce IRT roles: incident commander, technical lead, communications, legal, HR. Discuss incident severity levels and how they determine response intensity. Use a phishing attack that leads to a compromised email account as the running scenario."
            },
            {
              "id": "incident-f02",
              "title": "Incident Detection and Classification",
              "objectives": [
                "Identify common incident detection sources (SIEM, IDS, user reports, threat intelligence)",
                "Apply an incident classification and severity framework",
                "Perform initial triage and determine appropriate response levels"
              ],
              "keyTerms": ["SIEM", "IOC", "triage", "incident classification", "severity level"],
              "promptHints": "Cover how incidents are detected: automated tools (SIEM alerts, IDS/IPS, endpoint detection), human observation (user reports, helpdesk tickets), external notification (vendor advisories, law enforcement, threat intel). Walk through an incident classification scheme—categories (malware, unauthorized access, data breach, denial of service) and severity levels (1-4 with clear definitions). Show the triage process: validate, gather initial facts, classify, assign severity, and escalate. Use examples of real alert types and how to assess them."
            },
            {
              "id": "incident-f03",
              "title": "Business Continuity Planning Basics",
              "objectives": [
                "Explain the purpose and components of a Business Continuity Plan (BCP)",
                "Conduct a basic Business Impact Analysis (BIA) to identify critical processes",
                "Define Recovery Time Objective (RTO) and Recovery Point Objective (RPO)"
              ],
              "keyTerms": ["BCP", "BIA", "RTO", "RPO", "critical business function"],
              "promptHints": "Frame BCP as planning for the worst so business can continue. Walk through the BCP lifecycle: business impact analysis, risk assessment, strategy development, plan development, testing, and maintenance. Explain BIA in practical terms—identifying which business processes are most critical and what happens when they're disrupted for hours, days, or weeks. Define RTO and RPO with concrete examples: 'If our order processing system goes down, we can tolerate 4 hours (RTO) and can afford to lose 1 hour of data (RPO).' Use a manufacturing company dependent on IT systems as the example."
            },
            {
              "id": "incident-f04",
              "title": "Disaster Recovery Fundamentals",
              "objectives": [
                "Distinguish between business continuity and disaster recovery",
                "Identify common disaster recovery strategies (hot, warm, cold sites; backup approaches)",
                "Create a basic disaster recovery plan for critical IT systems"
              ],
              "keyTerms": ["disaster recovery", "hot site", "warm site", "cold site", "backup strategy"],
              "promptHints": "Clarify the relationship: BCP is about business processes continuing, DR is about restoring IT systems and data. Cover DR strategies ranging from low-cost/slow-recovery (cold site, tape backups) to high-cost/fast-recovery (hot site, real-time replication). Discuss backup types (full, incremental, differential) and the 3-2-1 rule. Walk through creating a basic DR plan: system inventory, recovery priorities, procedures, contacts, and testing schedule. Use the scenario of a company planning DR for a cloud-based application with a database backend."
            },
            {
              "id": "incident-f05",
              "title": "Incident Communication and Notification",
              "objectives": [
                "Develop internal and external incident communication procedures",
                "Identify regulatory notification requirements for data breaches",
                "Write effective incident notifications for different audiences"
              ],
              "keyTerms": ["breach notification", "communication plan", "holding statement", "stakeholder communication", "notification timeline"],
              "promptHints": "Communication can make or break incident response. Cover internal communication: who notifies whom, escalation paths, war room protocols. Then external: customer notification, regulatory notification requirements (GDPR 72-hour rule, state breach notification laws, sector-specific requirements), media handling, and law enforcement coordination. Show examples of good and bad breach notification letters. Discuss the balance between transparency and legal protection. Walk through a scenario where a company discovers a data breach affecting 50,000 customers."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "incident-i01",
              "title": "Building an Incident Response Plan",
              "objectives": [
                "Develop a comprehensive incident response plan with playbooks for common incident types",
                "Define escalation procedures, communication templates, and decision authorities",
                "Integrate the IR plan with legal, HR, communications, and executive leadership"
              ],
              "keyTerms": ["incident response plan", "playbook", "runbook", "escalation matrix", "war room"],
              "promptHints": "Move from concept to practical plan development. Walk through creating a complete IR plan: purpose and scope, team structure and roles, incident classification, playbooks for specific incident types (ransomware, data breach, insider threat, DDoS, supply chain compromise), escalation matrix, communication templates, and legal considerations. Show the difference between a playbook (decision-making guide) and a runbook (step-by-step procedures). Discuss integrating with other departments—when does legal get called? When does HR get involved? When does the CEO need to know?"
            },
            {
              "id": "incident-i02",
              "title": "Tabletop Exercises and IR Testing",
              "objectives": [
                "Design and facilitate tabletop exercises for incident response scenarios",
                "Develop inject sequences that test decision-making and communication",
                "Capture lessons learned and update plans based on exercise results"
              ],
              "keyTerms": ["tabletop exercise", "inject", "scenario", "after-action report", "lessons learned"],
              "promptHints": "Tabletop exercises are the most cost-effective way to test IR plans. Walk through the complete process: choosing a scenario (realistic, relevant, and challenging), developing the exercise script with timed injects (new information revealed at intervals), facilitating the discussion, and producing an after-action report. Show a sample tabletop scenario—e.g., a ransomware attack that escalates from one server to critical systems over 4 hours. Include decision points: Do you pay the ransom? When do you notify customers? Do you call law enforcement? Discuss how to engage executives who are uncomfortable with technical scenarios."
            },
            {
              "id": "incident-i03",
              "title": "Business Continuity Strategy and Plan Development",
              "objectives": [
                "Develop business continuity strategies for different disruption scenarios",
                "Create detailed continuity plans for critical business processes",
                "Implement plan maintenance, distribution, and accessibility protocols"
              ],
              "keyTerms": ["continuity strategy", "alternate processing", "manual workaround", "plan maintenance", "plan distribution"],
              "promptHints": "Go deeper into BCP—from strategy to executable plans. Cover strategy options: alternate work locations, remote work capabilities, manual workarounds, alternate suppliers, cross-training. Walk through writing a continuity plan for a specific business process—the plan should be usable by someone unfamiliar with the process. Discuss plan format (concise, checklist-driven), accessibility during a disruption (don't store plans only on the systems that might be down), and maintenance (annual reviews, updates when processes change). Use a financial services firm planning continuity for customer-facing operations."
            },
            {
              "id": "incident-i04",
              "title": "Crisis Management and Leadership",
              "objectives": [
                "Establish a crisis management team and command structure",
                "Develop crisis communication strategies for media, customers, and regulators",
                "Make high-stakes decisions under pressure with incomplete information"
              ],
              "keyTerms": ["crisis management", "crisis team", "crisis communication", "media response", "stakeholder management"],
              "promptHints": "Crisis management is about leadership when things go very wrong. Distinguish crisis management (strategic, executive-level) from incident response (tactical, technical). Cover establishing the crisis management team: who's on it (CEO, CISO, General Counsel, Head of Communications, Head of Customer Service), how it activates, and decision authority. Discuss crisis communication—holding statements, press conferences, social media response, and customer communication. Walk through a major crisis scenario: a high-profile data breach that's hit the news, customers are calling, regulators are asking questions, and the stock price is dropping."
            },
            {
              "id": "incident-i05",
              "title": "Post-Incident Analysis and Improvement",
              "objectives": [
                "Conduct effective post-incident reviews without blame",
                "Identify root causes and contributing factors using structured analysis",
                "Transform lessons learned into concrete improvements to policies, controls, and procedures"
              ],
              "keyTerms": ["post-incident review", "root cause analysis", "blameless postmortem", "corrective action", "5 Whys"],
              "promptHints": "Post-incident analysis is where organizations actually learn and improve. Cover conducting blameless postmortems—focusing on systemic issues rather than individual blame. Walk through root cause analysis techniques: 5 Whys, fishbone diagrams, timeline analysis. Show how to document findings and transform them into actionable improvements—policy changes, control enhancements, training updates, technology investments. Discuss tracking improvement actions to completion. Use a real-world incident example and work through the postmortem process step by step."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "incident-a01",
              "title": "Advanced Incident Response: Ransomware and APTs",
              "objectives": [
                "Develop response strategies for sophisticated threats including ransomware and APTs",
                "Navigate the decision-making process for ransom payment scenarios",
                "Coordinate with law enforcement, cyber insurers, and external IR firms"
              ],
              "keyTerms": ["ransomware response", "APT", "cyber insurance", "law enforcement coordination", "external IR retainer"],
              "promptHints": "Cover the most challenging incident types. For ransomware: detection indicators, containment strategies (network segmentation, killing C2), the ransom payment decision (legal considerations, OFAC sanctions, insurance coverage, law enforcement guidance), and recovery from backups. For APTs: long-term compromise detection, living-off-the-land techniques, careful eradication to avoid alerting the attacker. Discuss working with external parties: cyber insurance claims process, engaging forensics firms, coordinating with FBI/CISA. Use a scenario where an organization discovers ransomware has encrypted 60% of its servers."
            },
            {
              "id": "incident-a02",
              "title": "Cyber Resilience and Organizational Resilience",
              "objectives": [
                "Design a cyber resilience strategy that goes beyond traditional DR/BCP",
                "Implement adaptive capacity and anti-fragile characteristics in systems and processes",
                "Integrate cyber resilience with enterprise risk management and strategic planning"
              ],
              "keyTerms": ["cyber resilience", "adaptive capacity", "anti-fragile", "resilience engineering", "fail-safe design"],
              "promptHints": "Move beyond recovery to resilience—the ability to absorb, adapt, and rapidly recover from disruptions. Discuss the shift from 'prevent all breaches' to 'assume breach and build resilience.' Cover resilience engineering principles: redundancy, diversity, modularity, fail-safe defaults, and adaptive capacity. Show how to assess organizational resilience maturity. Walk through designing systems that degrade gracefully rather than fail catastrophically. Discuss the relationship between cyber resilience and operational resilience (DORA, regulatory expectations). Use the example of a financial institution building a cyber resilience program."
            },
            {
              "id": "incident-a03",
              "title": "BC/DR Program Governance and Maturity",
              "objectives": [
                "Build a mature BC/DR program with governance, metrics, and continuous improvement",
                "Implement comprehensive testing programs including full-scale exercises",
                "Navigate regulatory requirements for BC/DR across industries"
              ],
              "keyTerms": ["program maturity", "exercise program", "BC/DR governance", "regulatory requirements", "ISO 22301"],
              "promptHints": "Cover building and maturing a BC/DR program at the enterprise level. Discuss governance structures—BC/DR committee, program owner, plan owners, exercise coordinators. Walk through implementing a testing program: tabletop exercises (quarterly), functional exercises (semi-annually), and full-scale tests (annually). Cover ISO 22301 as the standard for BC management systems. Discuss regulatory requirements: FFIEC for financial services, CMS for healthcare, NERC for utilities. Show how to measure program maturity and present status to the board."
            },
            {
              "id": "incident-a04",
              "title": "Legal and Regulatory Aspects of Incident Response",
              "objectives": [
                "Navigate legal requirements during incident response including preservation, privilege, and notification",
                "Coordinate with legal counsel to protect attorney-client privilege during investigations",
                "Manage regulatory reporting obligations across multiple jurisdictions"
              ],
              "keyTerms": ["legal hold", "attorney-client privilege", "forensic preservation", "regulatory notification", "litigation risk"],
              "promptHints": "Cover the critical legal dimensions of incident response. Discuss evidence preservation and legal hold requirements—what must be preserved and how. Explain attorney-client privilege in the IR context: hiring forensics firms through outside counsel, privileged investigation reports, and the risk of privilege waiver. Walk through regulatory notification requirements across jurisdictions (GDPR, state laws, SEC, banking regulators) and managing conflicting timelines. Cover litigation risks and how IR documentation can be discoverable. Use the scenario of a multi-state data breach at a publicly traded company."
            },
            {
              "id": "incident-a05",
              "title": "Building an Incident Response Capability",
              "objectives": [
                "Design and staff a Security Operations Center (SOC) or incident response capability",
                "Implement SOAR platforms and IR automation to improve response times",
                "Develop IR team skills through continuous training, certifications, and purple team exercises"
              ],
              "keyTerms": ["SOC", "SOAR", "IR automation", "purple team", "IR capability maturity"],
              "promptHints": "Cover building the organizational capability for incident response. Discuss SOC models: in-house, outsourced (MSSP), or hybrid. Walk through staffing: skills needed, certification paths (GCIH, GCFA, GREM), hiring challenges, and retention strategies. Cover technology: SIEM, SOAR, EDR, threat intelligence platforms, and forensic tools. Discuss IR automation—automating triage, enrichment, containment actions, and notification. Show how purple team exercises improve both detection and response capabilities. Use the example of a company deciding between building an internal SOC vs. using an MSSP."
            }
          ]
        }
      ]
    },
    {
      "name": "Third-Party Risk",
      "slug": "thirdparty",
      "description": "Identifying, assessing, managing, and monitoring risks associated with third-party vendors, suppliers, service providers, and the broader supply chain throughout the vendor lifecycle.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "thirdparty-f01",
              "title": "Introduction to Third-Party Risk Management",
              "objectives": [
                "Explain why third-party risk management (TPRM) is critical in modern business",
                "Identify the types of risks introduced by third parties (security, operational, compliance, reputational)",
                "Describe the vendor lifecycle: selection, onboarding, monitoring, offboarding"
              ],
              "keyTerms": ["third-party risk", "vendor", "supply chain", "vendor lifecycle", "outsourcing risk"],
              "promptHints": "Start with why this matters—use real breach examples caused by third parties (Target via HVAC vendor, SolarWinds supply chain attack, Okta via support contractor). Explain that organizations are only as secure as their weakest vendor. Cover the types of third-party risks and the complete vendor lifecycle. Discuss the difference between vendors, suppliers, service providers, and partners. Use the scenario of a company that discovers their cloud provider had a breach affecting their data."
            },
            {
              "id": "thirdparty-f02",
              "title": "Vendor Risk Assessment Fundamentals",
              "objectives": [
                "Classify vendors by risk tier based on data access, criticality, and exposure",
                "Conduct a basic vendor security assessment using questionnaires",
                "Evaluate vendor security posture using SOC reports and certifications"
              ],
              "keyTerms": ["vendor tiering", "security questionnaire", "SIG", "CAIQ", "vendor risk rating"],
              "promptHints": "Walk through how to assess vendor risk. Start with vendor tiering—criteria for determining if a vendor is critical, high, medium, or low risk (what data do they access? How critical are they to operations? Can they be easily replaced?). Then cover assessment methods: security questionnaires (SIG, CAIQ, custom), reviewing SOC 2 reports, checking certifications (ISO 27001, PCI-DSS). Discuss the challenge of vendor assessment at scale—hundreds of vendors, limited staff. Use the example of assessing a new SaaS HR system that will store employee PII."
            },
            {
              "id": "thirdparty-f03",
              "title": "Vendor Security Requirements and Contracts",
              "objectives": [
                "Define security requirements to include in vendor contracts",
                "Explain key contractual provisions: data handling, breach notification, audit rights",
                "Draft security addenda and data processing agreements"
              ],
              "keyTerms": ["security addendum", "data processing agreement", "audit rights", "breach notification clause", "indemnification"],
              "promptHints": "Cover the contractual foundation of vendor risk management. Walk through essential security contract provisions: data handling and classification requirements, encryption requirements, access controls, breach notification timelines (often more aggressive than regulatory—e.g., 24-48 hours), right to audit, insurance requirements, subcontractor restrictions, data return/destruction on termination, and indemnification clauses. Show examples of contract language for each provision. Discuss negotiating with vendors who resist security requirements. Use the example of negotiating a contract with a cloud payroll provider."
            },
            {
              "id": "thirdparty-f04",
              "title": "Due Diligence in Vendor Selection",
              "objectives": [
                "Conduct pre-contract due diligence on potential vendors",
                "Evaluate vendor financial stability, reputation, and security maturity",
                "Document and present vendor risk findings to decision-makers"
              ],
              "keyTerms": ["due diligence", "vendor evaluation", "financial stability", "reference check", "proof of concept"],
              "promptHints": "Cover the due diligence process before signing with a vendor. Walk through evaluating a vendor: security posture assessment (questionnaire, SOC report, pen test results), financial stability (can they stay in business?), legal/compliance standing (any regulatory actions?), references from other customers, and proof of concept/technical evaluation. Show how to create a vendor risk assessment report that helps decision-makers understand the risks and make an informed choice. Use the scenario of evaluating three competing cloud storage vendors for handling sensitive customer data."
            },
            {
              "id": "thirdparty-f05",
              "title": "Fourth-Party Risk and Supply Chain Awareness",
              "objectives": [
                "Explain fourth-party risk and why it matters (your vendor's vendors)",
                "Identify supply chain risk scenarios and their potential impact",
                "Map critical supply chain dependencies for key vendor relationships"
              ],
              "keyTerms": ["fourth-party risk", "supply chain risk", "nth-party risk", "subcontractor", "concentration risk"],
              "promptHints": "Expand the risk perspective beyond direct vendors to the entire supply chain. Use the SolarWinds example to illustrate how a compromised supplier can affect thousands of organizations. Explain fourth-party risk: if your cloud provider uses AWS, and AWS has an outage, that affects you. Walk through identifying and mapping supply chain dependencies. Discuss concentration risk—when many organizations rely on the same few providers. Cover software supply chain risks (open source dependencies, compromised packages). Use a scenario where a critical vendor's subcontractor suffers a breach."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "thirdparty-i01",
              "title": "Building a TPRM Program",
              "objectives": [
                "Design a Third-Party Risk Management program with governance, policies, and procedures",
                "Implement risk-based vendor tiering and assessment workflows",
                "Establish vendor inventory management and ongoing monitoring processes"
              ],
              "keyTerms": ["TPRM program", "vendor inventory", "risk-based tiering", "assessment workflow", "program governance"],
              "promptHints": "Walk through building a TPRM program from the ground up. Cover program governance (who owns TPRM—procurement, security, risk?), policy development (TPRM policy, assessment procedures, exception processes), vendor inventory management (how to maintain a complete list of vendors with risk classifications), assessment workflows (who does what, when, and how), and ongoing monitoring procedures. Discuss tools and automation for scaling TPRM. Use the scenario of a company with 500 vendors that currently has no formal TPRM program."
            },
            {
              "id": "thirdparty-i02",
              "title": "Advanced Vendor Assessment Techniques",
              "objectives": [
                "Conduct on-site vendor assessments and security reviews",
                "Use external risk intelligence platforms for continuous vendor monitoring",
                "Evaluate vendor security programs against specific frameworks and requirements"
              ],
              "keyTerms": ["on-site assessment", "security rating", "BitSight", "SecurityScorecard", "continuous monitoring"],
              "promptHints": "Go beyond questionnaires to more sophisticated assessment methods. Cover on-site assessments: planning, checklist development, interview techniques, physical security walkthrough, and documentation. Discuss external risk intelligence platforms (BitSight, SecurityScorecard, RiskRecon) that provide outside-in views of vendor security posture. Show how to use these tools for continuous monitoring rather than point-in-time assessments. Walk through evaluating a vendor against specific framework requirements (e.g., can this vendor support our ISO 27001 requirements?). Use the example of conducting an on-site assessment of a critical data center provider."
            },
            {
              "id": "thirdparty-i03",
              "title": "SLA Management and Performance Monitoring",
              "objectives": [
                "Design security and availability SLAs for vendor contracts",
                "Implement SLA monitoring and reporting mechanisms",
                "Manage SLA breaches and escalation procedures"
              ],
              "keyTerms": ["SLA", "service level", "uptime", "performance monitoring", "SLA breach"],
              "promptHints": "Cover the operational side of vendor management. Walk through designing meaningful SLAs: availability (99.9% vs. 99.99%), response times for security incidents, patch management timelines, data handling requirements, and reporting obligations. Show how to monitor SLA compliance—dashboards, regular reporting, and automated alerting. Discuss handling SLA breaches: escalation procedures, remediation plans, financial penalties, and when to consider contract termination. Use the example of managing SLAs with a cloud infrastructure provider that experiences recurring availability issues."
            },
            {
              "id": "thirdparty-i04",
              "title": "Vendor Incident Response and Business Continuity",
              "objectives": [
                "Develop incident response procedures for vendor-related security events",
                "Create vendor-specific business continuity and exit strategies",
                "Coordinate incident response across organizational boundaries"
              ],
              "keyTerms": ["vendor incident", "exit strategy", "vendor lock-in", "data portability", "coordinated response"],
              "promptHints": "Cover what happens when things go wrong with a vendor. Walk through vendor incident response: how to handle notification from a vendor about a breach, coordinating investigation across organizational boundaries, determining impact on your data and customers, and communication. Then cover exit strategies: planning for vendor failure or termination, data portability requirements, transition timelines, and avoiding vendor lock-in. Use the scenario of a critical SaaS vendor notifying you that they've experienced a data breach affecting your customer data."
            },
            {
              "id": "thirdparty-i05",
              "title": "Regulatory Requirements for Third-Party Risk",
              "objectives": [
                "Navigate regulatory expectations for vendor management (OCC, FFIEC, GDPR)",
                "Implement data processing agreements and processor management per GDPR requirements",
                "Prepare for regulatory examinations of the vendor management program"
              ],
              "keyTerms": ["regulatory expectations", "OCC guidance", "data processor", "supervisory authority", "regulatory examination"],
              "promptHints": "Cover the regulatory landscape for TPRM. Walk through key regulatory guidance: OCC Bulletin 2013-29 (bank vendor management), FFIEC guidance, GDPR processor requirements (Article 28), and sector-specific requirements. Show how to implement GDPR data processing agreements and manage sub-processor chains. Discuss preparing for regulatory examination of the TPRM program—what examiners look for, common findings, and how to demonstrate a mature program. Use the scenario of a bank preparing for an OCC examination of its vendor management practices."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "thirdparty-a01",
              "title": "Enterprise-Scale TPRM Program Management",
              "objectives": [
                "Scale TPRM operations for organizations with thousands of vendor relationships",
                "Implement automation and tooling to improve TPRM efficiency and coverage",
                "Design TPRM metrics and reporting for executive and board audiences"
              ],
              "keyTerms": ["TPRM at scale", "automation", "vendor risk analytics", "program metrics", "operational efficiency"],
              "promptHints": "Address the challenge of TPRM at enterprise scale—organizations with 5,000+ vendor relationships. Discuss automation strategies: automated questionnaire distribution and follow-up, API-based evidence collection, continuous monitoring tools, and risk scoring algorithms. Cover TPRM platforms (OneTrust, Prevalent, ProcessUnity, ServiceNow VRM) and how to evaluate and implement them. Show how to build a TPRM dashboard with metrics: assessment completion rates, average risk scores, overdue assessments, critical vendor issues. Use the scenario of a large financial institution modernizing its TPRM program."
            },
            {
              "id": "thirdparty-a02",
              "title": "Supply Chain Security and Software Supply Chain Risk",
              "objectives": [
                "Implement a comprehensive supply chain security program covering physical and digital supply chains",
                "Manage software supply chain risks including open source, SBOMs, and build pipeline security",
                "Apply frameworks like NIST C-SCRM and SLSA for supply chain risk management"
              ],
              "keyTerms": ["SBOM", "software supply chain", "SLSA", "C-SCRM", "dependency management"],
              "promptHints": "Cover the increasingly critical area of supply chain security. Discuss physical supply chain risks (counterfeit components, tampering, geographic concentration) and digital supply chain risks (compromised software updates, malicious packages, vulnerable dependencies). Walk through implementing SBOMs—what they are, how to generate and consume them, and using them for vulnerability management. Cover NIST C-SCRM practices, SLSA levels for build integrity, and how to assess software supply chain risks. Use real incidents: SolarWinds, Log4j, Codecov, as case studies."
            },
            {
              "id": "thirdparty-a03",
              "title": "Strategic Vendor Relationship Management",
              "objectives": [
                "Develop strategic partnerships with critical vendors that include security collaboration",
                "Implement vendor risk-sharing and joint security improvement programs",
                "Navigate complex vendor ecosystems and platform dependencies"
              ],
              "keyTerms": ["strategic partnership", "risk sharing", "joint security", "vendor ecosystem", "platform dependency"],
              "promptHints": "Move beyond adversarial vendor management to strategic partnership. Discuss how to work collaboratively with critical vendors on security—joint threat briefings, coordinated incident response exercises, shared security roadmaps. Cover risk-sharing models: how to structure partnerships where both parties have skin in the game. Address managing platform dependencies (AWS, Azure, Salesforce) where the vendor has significant leverage. Walk through designing a vendor governance model for a critical strategic relationship. Use the example of a company managing its relationship with its primary cloud provider."
            },
            {
              "id": "thirdparty-a04",
              "title": "Third-Party Risk in M&A and Corporate Transactions",
              "objectives": [
                "Assess third-party risk as part of M&A due diligence",
                "Integrate vendor portfolios and TPRM programs during mergers and acquisitions",
                "Manage vendor-related risks during divestitures and carve-outs"
              ],
              "keyTerms": ["M&A due diligence", "vendor portfolio integration", "inherited risk", "carve-out", "transition services agreement"],
              "promptHints": "Cover the TPRM implications of corporate transactions. During M&A due diligence: assess the target's vendor portfolio, identify critical vendor dependencies, evaluate vendor contract terms (change of control clauses, assignment provisions), and inherited vendor risks. Post-acquisition: integrate vendor inventories, harmonize TPRM processes, and reassess vendor risk in the new context. For divestitures: untangle shared vendor relationships, negotiate transition services agreements, and establish new vendor contracts. Use the scenario of a company acquiring a smaller firm with 200 vendors and no formal TPRM program."
            },
            {
              "id": "thirdparty-a05",
              "title": "Emerging Trends in Third-Party Risk",
              "objectives": [
                "Evaluate the impact of AI and emerging technologies on third-party risk profiles",
                "Implement zero-trust principles in vendor access and connectivity",
                "Navigate evolving regulatory expectations for third-party oversight"
              ],
              "keyTerms": ["AI vendor risk", "zero trust", "API security", "real-time risk monitoring", "regulatory evolution"],
              "promptHints": "Look at the future of TPRM. Cover AI-related vendor risks: vendors using AI to process your data (where does it go? is it used for training?), AI-powered risk assessment tools, and the need for AI-specific vendor requirements. Discuss zero-trust approaches to vendor access: just-in-time access, microsegmentation, API security, and continuous verification. Address API risks as more integrations move to API-based connectivity. Cover evolving regulations: EU DORA requirements for ICT third-party providers, SEC expectations, and the trend toward mandatory TPRM programs. Use the scenario of evaluating an AI vendor that will process sensitive customer data."
            }
          ]
        }
      ]
    },
    {
      "name": "Privacy",
      "slug": "privacy",
      "description": "Building and operating a privacy program that protects personal data, respects individual rights, and embeds privacy into organizational processes and technology through governance, engineering, and operational practices.",
      "levels": [
        {
          "name": "Foundational",
          "topics": [
            {
              "id": "privacy-f01",
              "title": "Introduction to Data Privacy",
              "objectives": [
                "Define personal data, PII, and sensitive personal data with examples from major privacy frameworks",
                "Distinguish between data privacy and data security and explain how they complement each other",
                "Identify the key stakeholders in an organization's privacy ecosystem (DPO, legal, engineering, business)"
              ],
              "keyTerms": ["personal data", "PII", "sensitive personal data", "data privacy", "data security", "data subject"],
              "promptHints": "Start with the fundamental question: what is privacy and why does it matter? Define personal data broadly (GDPR's expansive definition) vs. PII (US-centric, narrower). Give concrete examples of each category—obvious PII (SSN, name) vs. less obvious personal data (IP addresses, cookie IDs, device fingerprints). Clearly distinguish privacy from security: security protects data from unauthorized access, privacy governs how data is collected, used, shared, and retained even by authorized parties. Use the analogy of a bank vault (security) vs. banking regulations (privacy). Discuss the privacy ecosystem within an organization and who owns what."
            },
            {
              "id": "privacy-f02",
              "title": "Privacy Principles and Fair Information Practices",
              "objectives": [
                "Explain the Fair Information Practice Principles (FIPPs) and their influence on modern privacy law",
                "Describe the OECD Privacy Guidelines and their eight core principles",
                "Apply Ann Cavoukian's seven Privacy by Design principles to real-world scenarios"
              ],
              "keyTerms": ["FIPPs", "OECD Privacy Guidelines", "Privacy by Design", "purpose limitation", "data minimization", "transparency"],
              "promptHints": "Trace the history of privacy principles from the 1973 HEW report (FIPPs) through the 1980 OECD Guidelines to modern Privacy by Design. Cover FIPPs: notice/awareness, choice/consent, access/participation, integrity/security, enforcement/redress. Then the OECD's eight principles: collection limitation, data quality, purpose specification, use limitation, security safeguards, openness, individual participation, accountability. Then Cavoukian's seven PbD principles. Show how these foundational principles directly influenced GDPR's Article 5 principles. Use practical examples—how does 'data minimization' apply when building a customer registration form?"
            },
            {
              "id": "privacy-f03",
              "title": "Data Classification and Data Mapping",
              "objectives": [
                "Build a data classification scheme that categorizes data by sensitivity and privacy impact",
                "Conduct a data mapping exercise to identify what personal data is collected, where it flows, and who processes it",
                "Create a Record of Processing Activities (RoPA) as required by GDPR Article 30"
              ],
              "keyTerms": ["data classification", "data inventory", "data mapping", "data flow diagram", "RoPA", "processing activity"],
              "promptHints": "Cover the practical foundations of any privacy program. Start with data classification: why you need it, common tiers (public, internal, confidential, restricted), and how privacy adds a dimension (personal data categories, special categories under GDPR). Then move to data mapping: techniques for discovering what personal data exists across the organization (interviews, automated scanning, questionnaires to business units). Walk through creating a data flow diagram showing collection points, storage locations, processing purposes, sharing with third parties, and cross-border transfers. Then show how this feeds into a GDPR Article 30 RoPA. Use the example of mapping data flows for an e-commerce company."
            },
            {
              "id": "privacy-f04",
              "title": "Global Privacy Regulatory Landscape",
              "objectives": [
                "Compare the key provisions and scope of major global privacy laws (GDPR, CCPA/CPRA, LGPD, POPIA, PIPL)",
                "Identify which privacy regulations apply based on an organization's data processing activities and geographic reach",
                "Explain the trend toward comprehensive privacy legislation and its implications for global organizations"
              ],
              "keyTerms": ["GDPR", "CCPA", "CPRA", "LGPD", "POPIA", "PIPL", "extraterritorial scope", "adequacy"],
              "promptHints": "Provide a practitioner's survey of the global privacy landscape. Cover GDPR as the gold standard (extraterritorial reach, broad definition of personal data, heavy penalties). Then CCPA/CPRA in the US (consumer rights, opt-out model vs. GDPR's opt-in). Brazil's LGPD (GDPR-inspired but with unique provisions). South Africa's POPIA. China's PIPL (data localization, cross-border transfer restrictions). Touch on emerging laws in India, Japan (APPI), and the US state-level patchwork. Focus on practical differences: what triggers applicability, key rights granted, penalty structures, and cross-border transfer mechanisms. Use a scenario of a SaaS company with customers on five continents figuring out which laws apply."
            },
            {
              "id": "privacy-f05",
              "title": "Individual Rights and Consent Models",
              "objectives": [
                "List and explain the core data subject rights established across major privacy frameworks",
                "Distinguish between consent models: opt-in, opt-out, legitimate interest, and other lawful bases",
                "Evaluate when consent is the appropriate lawful basis vs. alternatives like legitimate interest or contractual necessity"
              ],
              "keyTerms": ["data subject rights", "right to access", "right to erasure", "consent", "opt-in", "opt-out", "legitimate interest", "lawful basis"],
              "promptHints": "Cover the individual rights that privacy laws grant to data subjects. Walk through GDPR rights: access (Article 15), rectification (Article 16), erasure/right to be forgotten (Article 17), restriction (Article 18), portability (Article 20), objection (Article 21), and automated decision-making (Article 22). Compare with CCPA rights: know, delete, opt-out of sale/sharing, non-discrimination. Then dive into consent models: GDPR's high bar for valid consent (freely given, specific, informed, unambiguous, affirmative action) vs. CCPA's opt-out model. Discuss when consent is NOT the best lawful basis—legitimate interest balancing test, contractual necessity, legal obligation. Use the scenario of a marketing team wanting to send emails to existing customers vs. new prospects."
            }
          ]
        },
        {
          "name": "Intermediate",
          "topics": [
            {
              "id": "privacy-i01",
              "title": "Privacy Impact Assessments (PIAs and DPIAs)",
              "objectives": [
                "Determine when a Privacy Impact Assessment or Data Protection Impact Assessment is required",
                "Conduct a DPIA following a structured methodology including risk identification and mitigation",
                "Integrate privacy assessments into the project lifecycle and change management processes"
              ],
              "keyTerms": ["PIA", "DPIA", "privacy risk", "high risk processing", "prior consultation", "threshold assessment"],
              "promptHints": "Cover the practical mechanics of conducting privacy assessments. Start with when DPIAs are required under GDPR Article 35 (systematic profiling, large-scale special category processing, systematic public monitoring) and the threshold/screening assessment to decide. Walk through a DPIA methodology step by step: describe the processing, assess necessity and proportionality, identify risks to individuals (not the organization), evaluate risk likelihood and severity, identify mitigation measures, document residual risk, and determine if prior consultation with the supervisory authority is needed. Show how to embed PIAs into the SDLC so they happen before development starts, not after. Provide a practical DPIA template. Use the scenario of assessing a new employee monitoring system."
            },
            {
              "id": "privacy-i02",
              "title": "Data Subject Access Requests (DSARs)",
              "objectives": [
                "Design an end-to-end DSAR fulfillment workflow from intake to response",
                "Implement identity verification procedures that balance security with accessibility",
                "Manage complex DSAR scenarios including exemptions, third-party data, and high-volume requests"
              ],
              "keyTerms": ["DSAR", "subject access request", "identity verification", "response timeline", "exemption", "redaction"],
              "promptHints": "Cover the operational challenge of handling DSARs at scale. Walk through the DSAR lifecycle: intake channels (web form, email, phone), identity verification (balancing security with friction—you can't demand a passport copy for a newsletter unsubscribe), searching across systems for the individual's data, reviewing and redacting third-party information, applying exemptions (legal privilege, trade secrets, others' rights), formatting the response, and delivering within the regulatory timeline (GDPR: 30 days, CCPA: 45 days). Discuss automation strategies: DSAR management platforms, pre-built data discovery queries, and self-service portals. Address edge cases: employee DSARs, requests from children's parents, vexatious requests. Use the scenario of a company receiving 50 DSARs per month and needing to build a scalable process."
            },
            {
              "id": "privacy-i03",
              "title": "Consent Management and Preference Centers",
              "objectives": [
                "Design a consent management architecture that captures, stores, and honors consent across systems",
                "Implement cookie consent mechanisms compliant with GDPR, ePrivacy, and CCPA requirements",
                "Build a user-facing preference center that gives individuals meaningful control over their data"
              ],
              "keyTerms": ["consent management platform", "CMP", "cookie consent", "TCF", "preference center", "consent receipt", "granular consent"],
              "promptHints": "Cover the technical and operational aspects of consent management. Start with consent architecture: how to capture consent with full context (what, when, who, which version of the notice), store consent records as audit evidence, and propagate consent decisions to downstream systems. Discuss cookie consent specifically: the ePrivacy Directive's requirements, GDPR's interpretation, the IAB Transparency and Consent Framework (TCF), and how CCPA's 'Do Not Sell' differs. Walk through implementing a Consent Management Platform (OneTrust, Cookiebot, custom) and the technical integration challenges. Then cover preference centers: letting users manage communication preferences, data sharing settings, and marketing opt-ins in one place. Use the scenario of a media company with a website, mobile app, and email newsletters needing unified consent management."
            },
            {
              "id": "privacy-i04",
              "title": "Privacy by Design and Default",
              "objectives": [
                "Embed privacy requirements into the software development lifecycle (SDLC) from design through deployment",
                "Apply data minimization, pseudonymization, and anonymization techniques to reduce privacy risk",
                "Implement privacy-protective default settings and architecture patterns"
              ],
              "keyTerms": ["Privacy by Design", "Privacy by Default", "data minimization", "pseudonymization", "anonymization", "k-anonymity", "privacy patterns"],
              "promptHints": "Cover the engineering side of privacy. Start with GDPR Article 25's legal requirement for data protection by design and by default. Walk through embedding privacy into the SDLC: privacy requirements gathering, threat modeling for privacy (LINDDUN methodology), design patterns (minimize, separate, abstract, hide, inform, control, enforce, demonstrate), privacy-focused code reviews, and privacy testing. Deep-dive on data minimization techniques: collect only what's needed, pseudonymize where possible (tokenization, hashing with salt), anonymize when feasible (k-anonymity, l-diversity, t-closeness). Discuss the tension between anonymization and data utility. Cover privacy-protective defaults: opt-out by default, minimal data collection in forms, automatic data retention limits. Use the scenario of a development team building a health and fitness app."
            },
            {
              "id": "privacy-i05",
              "title": "Cross-Border Data Transfers",
              "objectives": [
                "Navigate the legal mechanisms for transferring personal data across international borders",
                "Implement Standard Contractual Clauses (SCCs) and conduct Transfer Impact Assessments",
                "Address data localization requirements and design architectures that respect jurisdictional boundaries"
              ],
              "keyTerms": ["cross-border transfer", "SCCs", "adequacy decision", "BCRs", "Transfer Impact Assessment", "data localization", "Schrems II"],
              "promptHints": "Cover the complex area of international data transfers. Start with GDPR Chapter V: the general prohibition on transfers to countries without adequate protection, and the mechanisms to overcome it. Walk through adequacy decisions (which countries have them, the EU-US Data Privacy Framework and its history through Safe Harbor and Privacy Shield). Cover SCCs: the 2021 modernized clauses, the four modules (controller-to-controller, controller-to-processor, etc.), and the requirement for Transfer Impact Assessments (TIAs) post-Schrems II. Discuss BCRs for intra-group transfers. Address data localization laws that require data to stay in-country (Russia, China, certain sectors). Cover practical architecture patterns: regional data residency, processing in the origin region, and using local cloud regions. Use the scenario of a European company evaluating US-based cloud services after Schrems II."
            }
          ]
        },
        {
          "name": "Advanced",
          "topics": [
            {
              "id": "privacy-a01",
              "title": "Building and Maturing a Privacy Program",
              "objectives": [
                "Design a comprehensive privacy program with governance structure, policies, and operational procedures",
                "Define the DPO role and build a privacy team that partners effectively with legal, IT, and business units",
                "Assess privacy program maturity using established models and create a roadmap for improvement"
              ],
              "keyTerms": ["privacy program", "DPO", "privacy governance", "privacy maturity model", "AICPA privacy framework", "accountability"],
              "promptHints": "Cover building a privacy program from the ground up and maturing it over time. Start with governance: privacy program charter, reporting structure (where does the DPO sit—legal, compliance, CISO?), privacy committee, and executive sponsorship. Walk through the DPO role: qualifications, independence requirements under GDPR Article 37-39, tasks and responsibilities, and how to avoid conflicts of interest. Cover the core program elements: privacy policies (internal and external), privacy notices, training and awareness, vendor privacy management, incident response for privacy breaches, and privacy by design integration. Then discuss maturity models: AICPA Privacy Maturity Model, IAPP's privacy program framework, and creating a multi-year roadmap with measurable milestones. Use the scenario of a mid-size company appointing its first DPO and building a privacy program from scratch."
            },
            {
              "id": "privacy-a02",
              "title": "Privacy-Enhancing Technologies (PETs)",
              "objectives": [
                "Evaluate privacy-enhancing technologies and their applicability to different data processing scenarios",
                "Compare differential privacy, homomorphic encryption, secure multi-party computation, and federated learning",
                "Design data architectures that leverage PETs to enable data utility while preserving individual privacy"
              ],
              "keyTerms": ["PETs", "differential privacy", "homomorphic encryption", "secure multi-party computation", "federated learning", "synthetic data", "zero-knowledge proof"],
              "promptHints": "Cover the cutting-edge technical side of privacy. Start with why PETs matter: enabling data-driven decisions without compromising individual privacy. Walk through each major PET category with practical examples. Differential privacy: adding calibrated noise to query results (how Apple and Google use it for telemetry). Homomorphic encryption: computing on encrypted data without decrypting (limitations and current practical applications). Secure multi-party computation: multiple parties computing joint results without revealing individual inputs (use in financial benchmarking). Federated learning: training ML models without centralizing data (healthcare applications). Synthetic data: generating statistically representative datasets that contain no real personal data. Zero-knowledge proofs: proving a statement without revealing the underlying data (age verification without revealing birthdate). For each, discuss maturity level, performance trade-offs, and real-world adoption. Use the scenario of a healthcare consortium wanting to train an AI model across hospital datasets without sharing patient records."
            },
            {
              "id": "privacy-a03",
              "title": "Data Breach Notification and Privacy Incident Response",
              "objectives": [
                "Compare breach notification requirements across major privacy regulations and determine notification obligations",
                "Design a privacy-specific incident response plan that covers detection, assessment, containment, and notification",
                "Conduct breach severity assessments to determine individual harm and regulatory notification thresholds"
              ],
              "keyTerms": ["breach notification", "personal data breach", "notification threshold", "supervisory authority", "risk to rights and freedoms", "breach assessment"],
              "promptHints": "Cover the privacy-specific aspects of breach response (distinct from general incident response which is in the IR domain). Start with what constitutes a personal data breach under GDPR (confidentiality, integrity, and availability breaches) vs. breach definitions under CCPA, HIPAA, and state breach notification laws. Walk through notification requirements: GDPR's 72-hour window to supervisory authority, individual notification when 'high risk,' CCPA's 'expedient' requirement, and the varying US state notification timelines. Cover the breach assessment methodology: determining the nature of the breach, categories and volume of data, likely consequences, and measures taken. Discuss the breach severity assessment to determine if notification thresholds are met. Cover the notification content requirements and communication strategies. Address the coordination between privacy, security, legal, and communications teams. Use the scenario of discovering that a database containing customer records was exposed to the internet for two weeks."
            },
            {
              "id": "privacy-a04",
              "title": "Privacy in Emerging Technologies",
              "objectives": [
                "Assess privacy risks specific to AI/ML systems including training data, model outputs, and automated decision-making",
                "Evaluate privacy implications of IoT, biometric data collection, and location tracking technologies",
                "Apply privacy frameworks to emerging technology scenarios including children's data and the EU AI Act"
              ],
              "keyTerms": ["AI privacy", "automated decision-making", "biometric data", "IoT privacy", "children's privacy", "COPPA", "EU AI Act", "algorithmic transparency"],
              "promptHints": "Cover privacy challenges posed by new and emerging technologies. Start with AI/ML privacy: training data consent issues, model memorization and data extraction attacks, automated decision-making rights under GDPR Article 22, explainability requirements, and the EU AI Act's privacy-relevant provisions (high-risk AI systems, transparency obligations). Cover biometric data: fingerprints, facial recognition, voice prints—their special category status under GDPR, Illinois BIPA, and the growing wave of biometric privacy laws. Address IoT privacy: smart home devices, wearables, connected vehicles—the challenge of providing notice and obtaining consent from ambient data collection. Discuss children's privacy: COPPA requirements, GDPR's provisions for children's consent (Article 8), the UK Age Appropriate Design Code, and California's Age-Appropriate Design Code Act. Use the scenario of a company deploying facial recognition for building access while also rolling out an AI chatbot for customer service."
            },
            {
              "id": "privacy-a05",
              "title": "Privacy Program Metrics and Continuous Improvement",
              "objectives": [
                "Design a privacy metrics framework that demonstrates program effectiveness to executives and regulators",
                "Conduct internal privacy audits and assessments to identify gaps and measure compliance",
                "Build a continuous improvement cycle that adapts the privacy program to regulatory changes and organizational growth"
              ],
              "keyTerms": ["privacy metrics", "KPIs", "privacy audit", "program effectiveness", "regulatory readiness", "continuous improvement", "benchmarking"],
              "promptHints": "Cover how to measure, report on, and continuously improve a privacy program. Start with privacy metrics and KPIs: operational metrics (DSAR response times, DSAR volume, training completion rates, DPIA completion rates, consent rates), risk metrics (open privacy risks, incidents, vendor privacy compliance), and compliance metrics (policy coverage, RoPA completeness, regulatory findings). Show how to build a privacy dashboard for executive reporting and board-level communication. Cover privacy auditing: internal audit methodology, using ISO 27701 as an audit framework, common audit findings, and remediation tracking. Discuss regulatory readiness assessments: preparing for supervisory authority inquiries, maintaining evidence of compliance (accountability principle), and conducting mock regulatory inspections. Address continuous improvement: staying current with regulatory changes, updating the privacy program based on audit findings, benchmarking against industry peers, and adapting to organizational changes (new products, M&A, geographic expansion). Use the scenario of a privacy team presenting its annual program report to the board of directors."
            }
          ]
        }
      ]
    }
  ]
}
